[
    {
        "id": "t3_18c3yu9",
        "createdAt": "2023-12-06T13:28:17.888000+0000",
        "title": "TIL that whales can get infected by lice and every whale species has its corresponding louse species.",
        "score": 4801.0,
        "commentCount": 102.0
    },
    {
        "id": "t3_18c40xu",
        "createdAt": "2023-12-06T13:31:25.241000+0000",
        "title": "TIL: \"Twinkle Twinkle Little Star\" has 5 verses",
        "score": 70.0,
        "commentCount": 33.0
    },
    {
        "id": "t3_18c48la",
        "createdAt": "2023-12-06T13:42:45.035000+0000",
        "title": "TIL Saturn's Moon Titan has actual lakes, rivers and even clouds and fog made out of liquid methane",
        "score": 1253.0,
        "commentCount": 38.0
    },
    {
        "id": "t3_18c58j2",
        "createdAt": "2023-12-06T14:33:19.223000+0000",
        "title": "TIL Time did not originally name a \"Man of the Year\" in 1941; Dumbo the elephant, whose film was released that year, was supposed to be \"Mammal of the Year\". Then Pearl Harbor happened and U.S. President Franklin D. Roosevelt was quickly anointed \"Man of the Year\" (for a record third time).",
        "score": 3102.0,
        "commentCount": 29.0
    },
    {
        "id": "t3_18c6i4j",
        "createdAt": "2023-12-06T15:32:42.418000+0000",
        "title": "TIL that the H. L. Hunley submarine was the first sub in recorded history to sink an enemy warship.",
        "score": 1169.0,
        "commentCount": 38.0
    },
    {
        "id": "t3_18c73tm",
        "createdAt": "2023-12-06T16:00:11.898000+0000",
        "title": "TIL that rafflesia arnoldii, found in the rainforests of Sumatra, produces the world's largest flower. It can reach over 3 feet (1 meter) in diameter.",
        "score": 91.0,
        "commentCount": 13.0
    },
    {
        "id": "t3_18c9yc2",
        "createdAt": "2023-12-06T18:02:54.096000+0000",
        "title": "TIL: The Third Reich produced a Titanic movie adaptation in 1943 used as propaganda blaming British and American capitalism for the tragedy",
        "score": 2166.0,
        "commentCount": 155.0
    },
    {
        "id": "t3_18ca2qo",
        "createdAt": "2023-12-06T18:08:03.446000+0000",
        "title": "TIL in 2013, astronaut Chris Hadfield took a picture of Berlin at night from the International Space Station which showed the division between the former east and west through its streetlights. East Berlin looks orange due to sodium vapor lamps while West Berlin looks white due to fluorescent lamps.",
        "score": 5589.0,
        "commentCount": 21.0
    },
    {
        "id": "t3_18cargl",
        "createdAt": "2023-12-06T18:37:30.718000+0000",
        "title": "TIL there are 15 places named Wood End in the UK, with 3 being located in the same county",
        "score": 77.0,
        "commentCount": 20.0
    },
    {
        "id": "t3_18cba7m",
        "createdAt": "2023-12-06T18:59:40.707000+0000",
        "title": "TIL The Town of Hempstead, NY (founded in 1644), is the largest town in America, with a population of ~800k it has roughly the same population as San Francisco and is more densely populated than cities like Detroit, Denver, and Las Vegas",
        "score": 505.0,
        "commentCount": 104.0
    },
    {
        "id": "t3_18cbdi5",
        "createdAt": "2023-12-06T19:03:09.032000+0000",
        "title": "TIL that after South Korea beat Germany at the FIFA World Cup 2018, ensuring Mexico’s place in the knockout, hundreds of Mexican fans descended on the South Korean embassy in Mexico City to celebrate",
        "score": 575.0,
        "commentCount": 8.0
    },
    {
        "id": "t3_18cer8o",
        "createdAt": "2023-12-06T21:28:23.696000+0000",
        "title": "TIL Nintendo copied LEGO in the 60´s and outsold them for a few years in Japan. Their N&B Block series were very similar to LEGO an way more popular because they had more round shapes. Nintendo stopped the N&B Block series in the early 70s, most likely due to legal pressure from LEGO.",
        "score": 5573.0,
        "commentCount": 101.0
    },
    {
        "id": "t3_18cevy6",
        "createdAt": "2023-12-06T21:33:48.737000+0000",
        "title": "TIL indigenous bolivians in the Andes have evolved to be arsenic resistant due the strong presence of AS3MT enzyme in their bodies that can metabolize the toxic element which is naturally found in drinking water.",
        "score": 2186.0,
        "commentCount": 24.0
    },
    {
        "id": "t3_18cftnn",
        "createdAt": "2023-12-06T22:13:55.827000+0000",
        "title": "TIL that french fries can be made out of prickly pear cactuses. Called Cactus Fries, they are found in Tex-Mex and New Mexican cuisine and have a texture compared to okra or onion rings.",
        "score": 444.0,
        "commentCount": 35.0
    },
    {
        "id": "t3_18cfz02",
        "createdAt": "2023-12-06T22:20:31.476000+0000",
        "title": "TIL Real skeletons were used in the making of the original \"Poltergeist\" film (1982)",
        "score": 47.0,
        "commentCount": 17.0
    },
    {
        "id": "t3_18cgxt7",
        "createdAt": "2023-12-06T23:03:45.836000+0000",
        "title": "TIL while filming the scene in 1983’s “A Christmas Story” where Ralphie is dressed as a sheriff, a prop man gave actor Peter Billingsley real Red Man chewing tobacco. Peter, who was 12, didn’t know the difference and ingested it. Production then had to be shut down until Billingsley recovered.",
        "score": 16029.0,
        "commentCount": 467.0
    },
    {
        "id": "t3_18cgzjh",
        "createdAt": "2023-12-06T23:05:48.884000+0000",
        "title": "TIL of Francis Bowes Sayre Jr., grandson of U.S. president Woodrow Wilson. Unlike his grandfather, who authorized and imposed widespread federal segregation, Francis was a fierce opponent of segregation, going so far as to march alongisde Martin Luther King Jr. from Selma to Montgomery.",
        "score": 174.0,
        "commentCount": 3.0
    },
    {
        "id": "t3_18ckzjf",
        "createdAt": "2023-12-07T02:20:15.107000+0000",
        "title": "TIL that Apollo 8 astronauts Jim Lovell and William Anders are the earliest living recipients of Time Magazine's \"Person of the Year\" award, having been selected by the magazine for its 1968 issue",
        "score": 110.0,
        "commentCount": 7.0
    },
    {
        "id": "t3_18cluro",
        "createdAt": "2023-12-07T03:04:25.065000+0000",
        "title": "TIL only 17% of the global population lives in “fully developed” countries (HDI > 0.8)",
        "score": 249.0,
        "commentCount": 62.0
    },
    {
        "id": "t3_18cnlst",
        "createdAt": "2023-12-07T04:39:06.861000+0000",
        "title": "TIL that the Seminole Tribe did not exist prior to the 1700s. It was formed in Spanish Florida by members of other tribes who were displaced out of the English colonies by settlers. Florida's original indigenous population was extinct by then from disease and enslavement brought by the Spanish.",
        "score": 289.0,
        "commentCount": 27.0
    },
    {
        "id": "t3_18cptcf",
        "createdAt": "2023-12-07T06:51:59.252000+0000",
        "title": "TIL Phil Collins became an 'honorary Texan’ after donating over 200 artifacts to The Alamo. Collins has actually written a book on The Alamo as well.",
        "score": 1283.0,
        "commentCount": 72.0
    },
    {
        "id": "t3_18cpva2",
        "createdAt": "2023-12-07T06:55:31.491000+0000",
        "title": "TIL a New Zealand woman was detained in Kazakhstan because they did not believe New Zealand was a real country. When they asked her to show the country on a map, their map did not include New Zealand.",
        "score": 39483.0,
        "commentCount": 1509.0
    },
    {
        "id": "t3_18cq6hc",
        "createdAt": "2023-12-07T07:16:31.825000+0000",
        "title": "TIL Due to consistent rock falls, Reunion Island (Fr) has created the most expensive road in the World. It has been valued at 1.6 billion euros for 12.5 km. That is 133 million Euros per kilometer. The ring road is built in the ocean to avoid the rocks.",
        "score": 4617.0,
        "commentCount": 86.0
    },
    {
        "id": "t3_18cqbmr",
        "createdAt": "2023-12-07T07:26:49.163000+0000",
        "title": "TIL the \"earworm\" phenomenon (having a song stuck in your head in a loop) can occur due to the brain’s attempt to fill a gap in the auditory cortex",
        "score": 2794.0,
        "commentCount": 266.0
    },
    {
        "id": "t3_18crfb4",
        "createdAt": "2023-12-07T08:48:47.741000+0000",
        "title": "TIL that Weird Al Yankovic's \"White and Nerdy\" was so popular that despite the original song \"Ridin\" winning a Grammy, people would go up to Chamillionaire and say that they heard his version of Weird Al's song",
        "score": 2125,
        "commentCount": 166
    },
    {
        "id": "t3_18cris0",
        "createdAt": "2023-12-07T08:56:43.528000+0000",
        "title": "TIL that the most popular English song in the world is \"Happy Birthday to You\", according to The Guinness Book.",
        "score": 95,
        "commentCount": 16
    },
    {
        "id": "t3_18cuuhf",
        "createdAt": "2023-12-07T12:46:30.181000+0000",
        "title": "TIL Clownfish Turn Into Females When Older",
        "score": 841,
        "commentCount": 117
    },
    {
        "id": "t3_18cw0kw",
        "createdAt": "2023-12-07T13:50:59.805000+0000",
        "title": "TIL an Oxford University physicist claimed that for the moon landing conspiracy to be true, around 411,000 people would’ve needed to keep it secret. He also suggests the hoax would’ve broken down in 3.68 years.",
        "score": 35573,
        "commentCount": 2017
    },
    {
        "id": "t3_18cw30b",
        "createdAt": "2023-12-07T13:54:31.370000+0000",
        "title": "TIL although chopsticks have supplanted spoons for eating rice in China and Japan, Korean people continue to use spoons to eat rice and alternate back and forth with chopsticks during a meal",
        "score": 4948,
        "commentCount": 325
    },
    {
        "id": "t3_18cwd3e",
        "createdAt": "2023-12-07T14:08:25.457000+0000",
        "title": "TIL that because the Conférence Générale des Poids et Mesures requires that because upper-case letters are only used for units named for people, Ken Woolner was inspired to create a scientist, Claude Émile Jean-Baptiste Litre, which would allow people to use L for litre and avoid mixing up l and 1",
        "score": 682,
        "commentCount": 36
    },
    {
        "id": "t3_18cws5t",
        "createdAt": "2023-12-07T14:29:13.115000+0000",
        "title": "TIL in 1971 Congress passed a bill for a national daycare system but it was vetoed by then President Nixon",
        "score": 4919,
        "commentCount": 299
    },
    {
        "id": "t3_18cyfmo",
        "createdAt": "2023-12-07T15:46:21.493000+0000",
        "title": "TIL that to shoot ‘Jaws’ before digital effects, the crew built an exact replica of the boat that appears in the film, the ‘Orca,’ but with the ability to sink on command. The ‘Orca 2’ sank 24 times during filming. The boat was later placed on a private island where it was ransacked by fans.",
        "score": 1544,
        "commentCount": 20
    },
    {
        "id": "t3_18cyvxe",
        "createdAt": "2023-12-07T16:06:51.782000+0000",
        "title": "TIL the 7-Eleven convenience store's name dates to 1946, to reflect the stores' new 7 am to 11 pm hours of operation, which were unprecedented at the time.",
        "score": 1701,
        "commentCount": 26
    },
    {
        "id": "t3_18czbjy",
        "createdAt": "2023-12-07T16:26:38.535000+0000",
        "title": "TIL that Fuji apples are not named after Mount Fuji, rather they are named after the town of Fujisaki in Aomori prefecture, at the northern tip of Honshu Island. The Fuji in Fujisaki means \"wisteria\".",
        "score": 435,
        "commentCount": 12
    },
    {
        "id": "t3_18czf4k",
        "createdAt": "2023-12-07T16:31:09.197000+0000",
        "title": "TIL that the senior executive vice president of Tencent, David Wallerstein, has a prog metal band in which he plays guitar and sings, and goes by the pseudonym DarWin.",
        "score": 98,
        "commentCount": 14
    },
    {
        "id": "t3_18czygy",
        "createdAt": "2023-12-07T16:55:46.606000+0000",
        "title": "TIL that from year to year, winds and air pressure patterns change, causing different forces to act on the solid Earth. During El Niño years, for example, the rotation of the Earth may slow ever so slightly because of stronger winds, increasing the length of a day by a fraction of a millisecond",
        "score": 118,
        "commentCount": 7
    },
    {
        "id": "t3_18d004f",
        "createdAt": "2023-12-07T16:57:51.424000+0000",
        "title": "TIL: The home arena for the LA Lakers and Clippers, changed names in December 2021. It was the Staples Center but is now the Crypto. com Arena.",
        "score": 0,
        "commentCount": 45
    },
    {
        "id": "t3_18d1v0i",
        "createdAt": "2023-12-07T18:25:00.558000+0000",
        "title": "TIL the U.S. General Services Administration announced in 2023 that up to 6 lighthouses would be given away to entities willing to maintain and preserve them and make them available to the public. The lighthouses were no longer needed due to modern technology such as GPS.",
        "score": 2059,
        "commentCount": 37
    },
    {
        "id": "t3_18d2bw1",
        "createdAt": "2023-12-07T18:44:02.556000+0000",
        "title": "TIL that the cornfield in the beginning of Interstellar was planted specifically for the movie and sold for a profit",
        "score": 10852,
        "commentCount": 260
    },
    {
        "id": "t3_18d3ntg",
        "createdAt": "2023-12-07T19:41:32.780000+0000",
        "title": "TIL According to a 2019 survey on 4500+ Americans, the average age that children stop believing in Santa Claus is 8.4 y.o. The oldest average comes from the state of Mississippi at 10.2 y.o.",
        "score": 10742,
        "commentCount": 775
    },
    {
        "id": "t3_18d3uh4",
        "createdAt": "2023-12-07T19:49:51.957000+0000",
        "title": "TIL the United States runs a program with lasers and lunar reflectors that measure the distance to the moon, started in 1970 - with an accuracy better than 3 centimeters since the 1990s.",
        "score": 248,
        "commentCount": 39
    },
    {
        "id": "t3_18d4sul",
        "createdAt": "2023-12-07T20:31:31.287000+0000",
        "title": "TIL: Most sailboats over the length of 16 feet have some form of engine and/or auxiliary power.",
        "score": 3292,
        "commentCount": 146
    },
    {
        "id": "t3_18d5imp",
        "createdAt": "2023-12-07T21:02:05.266000+0000",
        "title": "TIL that woodsman Francis Wharton made dentures from a dead deer, and then ate the deer with its own teeth",
        "score": 1015,
        "commentCount": 59
    },
    {
        "id": "t3_18d5zsy",
        "createdAt": "2023-12-07T21:22:21.398000+0000",
        "title": "TIL that 1 to 4% of the general population has antisocial personality disorder.",
        "score": 2834,
        "commentCount": 405
    },
    {
        "id": "t3_18d6bjk",
        "createdAt": "2023-12-07T21:36:25.141000+0000",
        "title": "TIL That ex King Juan Carlos shot and killed his younger brother when he was a teenager. The stories about the \"accident \" have varied between family members and investigators.",
        "score": 7817,
        "commentCount": 242
    },
    {
        "id": "t3_18d6k13",
        "createdAt": "2023-12-07T21:46:52.408000+0000",
        "title": "TIL MLB Legend Ted Williams was “frozen cryonically” after his death in a process called neuropreservation",
        "score": 220,
        "commentCount": 78
    },
    {
        "id": "t3_18d8uur",
        "createdAt": "2023-12-07T23:30:44.137000+0000",
        "title": "TIL about “E-Squadron” or “The Increment”. Which is perhaps the most elite and secretive special forces group in the U.K.- maybe even better than the SAS.",
        "score": 77,
        "commentCount": 21
    },
    {
        "id": "t3_18d8z8m",
        "createdAt": "2023-12-07T23:36:24.547000+0000",
        "title": "TIL Although situated in Basel, Switzerland, the Basel Badischer Train Station is actually an enclave of the European Customs Union of Germany. This means the station operates as if in Germany, due to a treaty between Switzerland and Baden (Germany) dating back to 1852!",
        "score": 106,
        "commentCount": 17
    },
    {
        "id": "t3_18d9ep7",
        "createdAt": "2023-12-07T23:57:06.590000+0000",
        "title": "TIL Denver, CO has the nickname Menver because there’s so many more men than women for dating",
        "score": 873,
        "commentCount": 341
    },
    {
        "id": "t3_18d9n71",
        "createdAt": "2023-12-08T00:08:10.125000+0000",
        "title": "TIL when New Zealand crowd-sourced ideas for a new national flag, one of the most infamous designs was \"Fire the Lazer\", a flag with a silver fern and a kiwi shooting a laser out of its eyes.",
        "score": 1616.0,
        "commentCount": 49.0
    },
    {
        "id": "t3_18d9x59",
        "createdAt": "2023-12-08T00:22:00.208000+0000",
        "title": "TIL: Soaking and Jump Humping are a Mormon sex work around where there is no thrust = not sex",
        "score": 0.0,
        "commentCount": 116.0
    },
    {
        "id": "t3_18da5ts",
        "createdAt": "2023-12-08T00:34:19.651000+0000",
        "title": "TIL about Comstock laws. This Act criminalized any use of the U.S. Postal Service to send any of the following items:[2] obscenity, contraceptives, abortifacients, sex toys, personal letters with any sexual content or information.",
        "score": 2064.0,
        "commentCount": 140.0
    },
    {
        "id": "t3_18db00q",
        "createdAt": "2023-12-08T01:16:31.536000+0000",
        "title": "TIL that people \"Mailed Dimes 'By The Truck Load' to FDR's White House to Cure Polio\" | Smart News| Smithsonian Magazine",
        "score": 1036.0,
        "commentCount": 54.0
    },
    {
        "id": "t3_18dc23l",
        "createdAt": "2023-12-08T02:11:29.785000+0000",
        "title": "TIL in the earliest depictions of Jesus from the 3rd century, he was presented as a beardless man wearing Roman clothes",
        "score": 3808.0,
        "commentCount": 474.0
    },
    {
        "id": "t3_18dch42",
        "createdAt": "2023-12-08T02:33:08.665000+0000",
        "title": "TIL Federico da Montefeltro lost one of his eyes in a tournament so he had the bridge of his nose removed to increase the field of vision of his remaining eye.",
        "score": 2618.0,
        "commentCount": 82.0
    },
    {
        "id": "t3_18dclmv",
        "createdAt": "2023-12-08T02:39:44.881000+0000",
        "title": "TIL that the record for the longest gap between release and reaching number one on the Billboard charts was set by the Mariah Carey song \"All I Want for Christmas Is You\", which first reached number one in the United States 25 years after its release.",
        "score": 277.0,
        "commentCount": 25.0
    },
    {
        "id": "t3_18ddona",
        "createdAt": "2023-12-08T03:37:22.716000+0000",
        "title": "TIL there are 78,000 people in the \"Unorganized Borough\" of Alaska, which has an area of 323,440 sq mi (still larger than Texas the second biggest state). This is equivalent in population to Chelan County, Washington, or one-twentieth of Manhattan, less than one square mile.",
        "score": 227.0,
        "commentCount": 32.0
    },
    {
        "id": "t3_18dee71",
        "createdAt": "2023-12-08T04:15:21.308000+0000",
        "title": "TIL that there are around 350,000 unsolved murders since 1965 in the United States.",
        "score": 1936.0,
        "commentCount": 176.0
    },
    {
        "id": "t3_18deq5i",
        "createdAt": "2023-12-08T04:33:08.636000+0000",
        "title": "TIL that a chipotle pepper is a jalapeño that has been dried and smoked.",
        "score": 266.0,
        "commentCount": 42.0
    },
    {
        "id": "t3_18diw5o",
        "createdAt": "2023-12-08T09:06:00.761000+0000",
        "title": "TIL There are fossilized plants in Greenland under 1.4 km of ice. At the bottom of a 1.4 km core sample, which was taken in 1966 at Camp Century, researchers found \"well-preserved fossil plants and biomolecules,\" which means that the massive sheet melted and reformed at least once in the last millio",
        "score": 597.0,
        "commentCount": 29.0
    },
    {
        "id": "t3_18dkcfj",
        "createdAt": "2023-12-08T10:55:08.178000+0000",
        "title": "TIL on January 23, 1556 a massive earthquake, measuring 9.0 on the Richter scale, struck Shaanxi, China, killing over 850,000 people. This is the most devastating earthquake in recorded history.",
        "score": 1391.0,
        "commentCount": 106.0
    },
    {
        "id": "t3_18dl8v5",
        "createdAt": "2023-12-08T11:54:59.512000+0000",
        "title": "TIL At the start of World War 2 the tops of pillar post boxes were painted with an invisible gas detection paint that would turn yellow in the event of a gas attack.",
        "score": 261.0,
        "commentCount": 1.0
    },
    {
        "id": "t3_18dlkph",
        "createdAt": "2023-12-08T12:15:46.435000+0000",
        "title": "TIL Van Gogh's sister in law was behind Van Gogh’s posthumous success and fame, She dedicated her life to spreading his art and legacy after his death, She preserved and published his letters, organized and exhibited his paintings, wrote and translated articles and books about him",
        "score": 25533.0,
        "commentCount": 302.0
    },
    {
        "id": "t3_18dm0xi",
        "createdAt": "2023-12-08T12:43:48.309000+0000",
        "title": "TIL that White Castle, founded in 1921, predates McDonald's by nearly two decades, establishing itself as America's first fast-food hamburger chain.",
        "score": 3055.0,
        "commentCount": 240.0
    },
    {
        "id": "t3_18dmek9",
        "createdAt": "2023-12-08T13:05:02.255000+0000",
        "title": "TIL about Bob Jones University, a Christian university where students are only allowed to watch G-rated movies and rock music is banned",
        "score": 12155.0,
        "commentCount": 1681.0
    },
    {
        "id": "t3_18dnmoi",
        "createdAt": "2023-12-08T14:09:53.000000+0000",
        "title": "TIL the drawing of the bear on Alaska's license plates was appropriated from artist Douglas Allen without his permission. The plates were first released in 1976 but Allen didn't even know until 2015. Allen had never been to Alaska - he sketched the bear at the Bronx Zoo.",
        "score": 5911.0,
        "commentCount": 65.0
    },
    {
        "id": "t3_18dnybh",
        "createdAt": "2023-12-08T14:25:46.300000+0000",
        "title": "TIL Linda Fiorentino, aka Bethany from Dogma and Laurel from Men in Black, dated an FBI agent to gain access to his work files to try to help her boyfriend avoid jail time",
        "score": 203.0,
        "commentCount": 12.0
    },
    {
        "id": "t3_18dp5ak",
        "createdAt": "2023-12-08T15:23:43.639000+0000",
        "title": "TIL pants are always plural because it’s a “plural tantum” which is Latin for “plural only,”",
        "score": 411.0,
        "commentCount": 165.0
    },
    {
        "id": "t3_18dp9ge",
        "createdAt": "2023-12-08T15:29:12.539000+0000",
        "title": "TIL that in his youth, Napoleon was actually an outspoken Corsican nationalist, and advocated for Corsica's independence from France.",
        "score": 2416.0,
        "commentCount": 68.0
    },
    {
        "id": "t3_18dpcgg",
        "createdAt": "2023-12-08T15:33:07.400000+0000",
        "title": "TIL that the person who published the first map with the word America, later tried to change the continent's name to Parrotland.",
        "score": 5675.0,
        "commentCount": 85.0
    },
    {
        "id": "t3_18dsd1d",
        "createdAt": "2023-12-08T17:50:44.803000+0000",
        "title": "TIL Saturn has 146 moons in its orbit. The moons range in size from larger than the planet Mercury to a sports arena",
        "score": 325.0,
        "commentCount": 30.0
    },
    {
        "id": "t3_18dsk92",
        "createdAt": "2023-12-08T18:00:08.754000+0000",
        "title": "TIL that Execution by Electric Chair was almost called \"gerrycide\" after the grandson of the guy who gerrymandering is named after.",
        "score": 51.0,
        "commentCount": 1.0
    },
    {
        "id": "t3_18dsr2f",
        "createdAt": "2023-12-08T18:08:35.015000+0000",
        "title": "TIL about XT11, a severely disabled infant chimpanzee that exhibited Down syndrome-like symptoms and other congenital birth defects. Her mother and sister took care of her anyway and her social group did not reject her. She survived in the wild for 23 months.",
        "score": 10079.0,
        "commentCount": 180.0
    },
    {
        "id": "t3_18dtmk3",
        "createdAt": "2023-12-08T18:47:49.351000+0000",
        "title": "TIL former Alben Barkley, relegated to the back bench in his return to the Senate, noted in a speech, “I’m glad to sit in the back row, for I would rather be a servant in the House of the Lord than to sit in the seats of the mighty.” He then dropped dead.",
        "score": 488.0,
        "commentCount": 58.0
    },
    {
        "id": "t3_18du96n",
        "createdAt": "2023-12-08T19:16:26.010000+0000",
        "title": "TIL that Dire Straits's bassist John Illsley owns a pub in Hampshire which was rated as one of the \"Fifty Best Pubs Around Britain\" by the Times. He has also decorated the pub with his own paintings.",
        "score": 226.0,
        "commentCount": 11.0
    },
    {
        "id": "t3_18duup2",
        "createdAt": "2023-12-08T19:44:09.525000+0000",
        "title": "TIL child prodigy Adragon De Mello's father planned for his son to get a Ph.D. in physics by age 12, win the Nobel Prize by age 16, and then become a Senator, a President, the head of a world government, and ultimately the chairman of an \"intergalactic government\".",
        "score": 11809.0,
        "commentCount": 508.0
    },
    {
        "id": "t3_18dviah",
        "createdAt": "2023-12-08T20:12:49.849000+0000",
        "title": "TIL Humphrey Bogart was an avid chess player and often played correspondence chess with soldiers overseas during World War II. In 1943, the FBI told him to stop doing so after they intercepted his mail believing the chess notations to be secret codes.",
        "score": 3157.0,
        "commentCount": 34.0
    },
    {
        "id": "t3_18dvikl",
        "createdAt": "2023-12-08T20:13:10.943000+0000",
        "title": "TIL the moon is moving away from Earth by about 1.5 inches (3.8 centimeters) every year",
        "score": 1938.0,
        "commentCount": 143.0
    },
    {
        "id": "t3_18dvu62",
        "createdAt": "2023-12-08T20:27:23.316000+0000",
        "title": "TIL that the 8 hour working day was first instituted by king Philip II of Spain in 1594 (although many countries in the world still have to adopt it)",
        "score": 216.0,
        "commentCount": 13.0
    },
    {
        "id": "t3_18dw3c5",
        "createdAt": "2023-12-08T20:39:01.909000+0000",
        "title": "TIL Mongolians annually eat 45.1 kg of lamb per person. In comparison, Americans consume only .5 kg per person yearly.",
        "score": 2457.0,
        "commentCount": 394.0
    },
    {
        "id": "t3_18dx5et",
        "createdAt": "2023-12-08T21:26:36.217000+0000",
        "title": "TIL In 1835 The New York Sun published a series of articles claiming that there were bat-like humanoids living on the moon. The stories were entirely fictional, but they fooled some readers at the time.",
        "score": 408.0,
        "commentCount": 39.0
    },
    {
        "id": "t3_18dxgj8",
        "createdAt": "2023-12-08T21:40:39.135000+0000",
        "title": "TIL it's not possible to watch every film ever nominated for Best Picture. Only 2/3 of 1928's The Patriot still exists, and the only complete prints of 1931's East Lynne and 1934's The White Parade are in the UCLA film archive",
        "score": 5699.0,
        "commentCount": 167.0
    },
    {
        "id": "t3_18dyw1o",
        "createdAt": "2023-12-08T22:46:48.116000+0000",
        "title": "TIL that Michelangelo was 24 when he completed La Pietà",
        "score": 171.0,
        "commentCount": 18.0
    },
    {
        "id": "t3_18dz7dp",
        "createdAt": "2023-12-08T23:01:21.266000+0000",
        "title": "TIL that Bancroft Hall at the US Naval Academy in Annapolis is the world's largest dorm, housing all 4,400 cadets (midshipmen) in a single building. The dorm has nearly 5 miles of hallways.",
        "score": 1006.0,
        "commentCount": 47.0
    },
    {
        "id": "t3_18dzlhd",
        "createdAt": "2023-12-08T23:19:51.076000+0000",
        "title": "TIL of the skydiver who survived a free-fall of 14500 feet by falling on an anthill. The bites of the ants kept her heart beating and adrenaline pumping",
        "score": 3974.0,
        "commentCount": 98.0
    },
    {
        "id": "t3_18dzy3z",
        "createdAt": "2023-12-08T23:36:45.879000+0000",
        "title": "TIL in 1972, astronaut Neil Armstrong visited the Scottish town of Langholm, where he was read a 400-year-old law declaring any “Armstrong” that enters the town must be hanged",
        "score": 27253.0,
        "commentCount": 748.0
    },
    {
        "id": "t3_18e045w",
        "createdAt": "2023-12-08T23:44:49.026000+0000",
        "title": "TIL When Ottoman envoys, citing a religious custom, declined to remove their turbans when meeting with Vlad (Dracula) the Impaler, Vlad saluted their devotion and decided to strengthen their custom by having three spikes driven through each of their heads, pinning the turbans in place forever.",
        "score": 6532.0,
        "commentCount": 399.0
    },
    {
        "id": "t3_18e0kzk",
        "createdAt": "2023-12-09T00:07:22.262000+0000",
        "title": "TIL that in Ohio, one of the first documented criminal rings was the Society of the Banana",
        "score": 64.0,
        "commentCount": 9.0
    },
    {
        "id": "t3_18e0u58",
        "createdAt": "2023-12-09T00:20:12.802000+0000",
        "title": "Today I learned that while working a movie theater in Arizona, Bill Hader got fired for spoiling the ending of Titanic",
        "score": 4557.0,
        "commentCount": 217.0
    },
    {
        "id": "t3_18e0vpy",
        "createdAt": "2023-12-09T00:22:26.151000+0000",
        "title": "TIL that a member of the Manson family attempted to kill president Gerald R. Ford",
        "score": 67.0,
        "commentCount": 11.0
    },
    {
        "id": "t3_18e29j8",
        "createdAt": "2023-12-09T01:33:06.158000+0000",
        "title": "TIL about ambigrams which are calligraphic writing of word so they can have similar or different meanings when viewed in different orientations.",
        "score": 83.0,
        "commentCount": 10.0
    },
    {
        "id": "t3_18e2gpd",
        "createdAt": "2023-12-09T01:43:29.298000+0000",
        "title": "TIL about Amboy, a community in the Mojave Desert of San Bernadino County. The town's business district contains a post office, a historic restaurant-motel, and a Route 66 gift shop, all operated by the town's population of four people.",
        "score": 250.0,
        "commentCount": 27.0
    },
    {
        "id": "t3_18e2oac",
        "createdAt": "2023-12-09T01:54:24.624000+0000",
        "title": "TIL that when the USS Badger State sank, some sailors were lost by being attacked by albatrosses.",
        "score": 1070.0,
        "commentCount": 26.0
    },
    {
        "id": "t3_18e3phd",
        "createdAt": "2023-12-09T02:50:14.311000+0000",
        "title": "TIL that in an ‘unfortunate evolutionary coincidence’ the δ-hexatoxins in Sydney Funnel-web spider venom are exceptionally dangerous to humans. A bite can kill a human in as little as 15 minutes.",
        "score": 8568.0,
        "commentCount": 579.0
    },
    {
        "id": "t3_18e4k3s",
        "createdAt": "2023-12-09T03:37:23.513000+0000",
        "title": "TIL That Bob Marley's Father was a Sixty Year Old 'Neurotic and Incontinent' World War One Veteran, who was Born in Sussex, and that Died when Marley was Ten Years Old.",
        "score": 160.0,
        "commentCount": 30.0
    },
    {
        "id": "t3_18e575c",
        "createdAt": "2023-12-09T04:14:26.906000+0000",
        "title": "TIL that Idaho is a made up word, not derived from the Shoshone language.",
        "score": 705.0,
        "commentCount": 85.0
    },
    {
        "id": "t3_18e5qr5",
        "createdAt": "2023-12-09T04:46:43.224000+0000",
        "title": "TIL that the reason mint tastes cold is that menthol activates a protein called TRPM8 in your nerve cells that normally respond to cold. It is the only food that does do. (Although capsaicin, similarly, activates a different protein, VR1, that senses heat.)",
        "score": 636.0,
        "commentCount": 16.0
    },
    {
        "id": "t3_18e5vs9",
        "createdAt": "2023-12-09T04:55:14.628000+0000",
        "title": "TIL that the fez was nearly universal as men’s headwear in the Ottoman Empire in the early 1900s. However, the hats were largely made in the Austrian Empire. When Austria annexed Bosnia in 1908, the Ottomans boycotted Austrian goods in protest. The fez’s popularity started to fade.",
        "score": 1264.0,
        "commentCount": 74.0
    },
    {
        "id": "t3_18e7e1d",
        "createdAt": "2023-12-09T06:30:16.656000+0000",
        "title": "TIL the least profitable NFL team (Buffalo - $65 million) is more profitable than the most profitable EPL club (Manchester City - $59 million).",
        "score": 2532.0,
        "commentCount": 409.0
    },
    {
        "id": "t3_18e7qj1",
        "createdAt": "2023-12-09T06:54:47.582000+0000",
        "title": "TIL female Buddhist monks are forbidden to eat garlic",
        "score": 247.0,
        "commentCount": 96.0
    },
    {
        "id": "t3_18e8ej9",
        "createdAt": "2023-12-09T07:40:32.685000+0000",
        "title": "TIL 10-20% of the world's population have allergies to cats or dogs. Even other animals, such as rabbits, guinea pigs, hamsters, ferrets and horses, can cause allergy symptoms.",
        "score": 196.0,
        "commentCount": 24.0
    },
    {
        "id": "t3_18e8tua",
        "createdAt": "2023-12-09T08:10:59.267000+0000",
        "title": "TIL that when Wyoming was going through the process of becoming a US state in 1890, the state demanded that women be given the right to vote. The US Congress denied this request. The state replied by saying that they'd \"remain out of the Union one hundred years rather than come in without the women\"",
        "score": 7322.0,
        "commentCount": 176.0
    },
    {
        "id": "t3_18e93fs",
        "createdAt": "2023-12-09T08:29:41.843000+0000",
        "title": "TIL that Kenny Rogers was singing at a private event of a hedge fund manager and asked to repeat 'The Gambler's over and over, being offered additional pay per song. After a dozen times and having earned $4 million, he refused to sing.",
        "score": 19847.0,
        "commentCount": 757.0
    },
    {
        "id": "t3_18ebfg1",
        "createdAt": "2023-12-09T11:12:23.635000+0000",
        "title": "TIL German mental calculator Gert Mittring broke the world record for taking roots when he successfully calculated the 89247th root of a million-digit number.",
        "score": 2167.0,
        "commentCount": 32.0
    },
    {
        "id": "t3_18eca07",
        "createdAt": "2023-12-09T12:07:56.530000+0000",
        "title": "TIL that The Simpsons episode where they go to Japan is banned in Japan.",
        "score": 10858.0,
        "commentCount": 657.0
    },
    {
        "id": "t3_18ecqzv",
        "createdAt": "2023-12-09T12:37:22.505000+0000",
        "title": "TIL about Don Black, a white supremacist, member of the American Nazi Party, Grand Wizard of the KKK and founder of the neo-nazi, Holocaust denial, homophobic website Stormfront; he was arrested by the ATF in 1981 while attempting a naval invasion and armed overthrow of the government of Dominica",
        "score": 307.0,
        "commentCount": 24.0
    },
    {
        "id": "t3_18edg95",
        "createdAt": "2023-12-09T13:19:30.835000+0000",
        "title": "TIL we still don't know what disease killed more than half the Native Americans in 1500.",
        "score": 11999.0,
        "commentCount": 1181.0
    },
    {
        "id": "t3_18edw2o",
        "createdAt": "2023-12-09T13:43:44.949000+0000",
        "title": "TIL Jingle Bells was originally written to be a Thanksgiving song and the lyrics don't make any reference to Christmas, instead focusing on sleigh racing.",
        "score": 561.0,
        "commentCount": 55.0
    },
    {
        "id": "t3_18eel6p",
        "createdAt": "2023-12-09T14:20:58.060000+0000",
        "title": "TIL Switzerland is the only member of the WTO (World Trade Organization) who calculates customs duties on industrial goods by weight, not value, since 1848. This 'ad pondus' method, favoring lighter, high-value goods, contrasts with the common 'ad valorem' system.",
        "score": 174.0,
        "commentCount": 6.0
    },
    {
        "id": "t3_18ef499",
        "createdAt": "2023-12-09T14:49:00.707000+0000",
        "title": "TIL the province of Quebec was renamed by the British after its capital city. Prior to that, it was simply called “Canada” by the French",
        "score": 279.0,
        "commentCount": 10.0
    },
    {
        "id": "t3_18egdb3",
        "createdAt": "2023-12-09T15:50:50.012000+0000",
        "title": "TIL An oil drilling operation at Lake Peigneur, Louisiana accidentally punctured a salt dome, creating a sinkhole that swallowed barges and caused the Delcambre Canal to flow backwards.",
        "score": 1016.0,
        "commentCount": 32.0
    },
    {
        "id": "t3_18eglca",
        "createdAt": "2023-12-09T16:01:20.507000+0000",
        "title": "TIL Canton Avenue in Pittsburgh, PA is the steepest officially recorded street in the United States, boasting a 37% grade in its hill.",
        "score": 8794.0,
        "commentCount": 374.0
    },
    {
        "id": "t3_18eglhx",
        "createdAt": "2023-12-09T16:01:32.078000+0000",
        "title": "TIL only one person correctly guessed who shot Mr. Burns in the Simpson’s 1995 contest. The person made a post online and the writers wanted to give them a special gift, but they were unable to find the anonymous poster and on the DVD commentary, they were still searching for the individual",
        "score": 11389.0,
        "commentCount": 185.0
    },
    {
        "id": "t3_18ehu9r",
        "createdAt": "2023-12-09T17:00:10.555000+0000",
        "title": "TIL that the vaguely named vegetable oil is not derived from corn, wheat, or a variety of other vegetables but almost always soybean oil.",
        "score": 1799.0,
        "commentCount": 127.0
    },
    {
        "id": "t3_18ei5sr",
        "createdAt": "2023-12-09T17:14:36.643000+0000",
        "title": "TIL Prior to 1970 most Pistachios were dyed red!",
        "score": 3666.0,
        "commentCount": 215.0
    },
    {
        "id": "t3_18ei71w",
        "createdAt": "2023-12-09T17:16:12.309000+0000",
        "title": "TIL:That Albert Einstein was a big fan of the puppet show *Time For Beany*. During one high level conference, he interrupted to say, \"You will have to excuse me, gentlemen. It's Time for Beany.\"",
        "score": 632.0,
        "commentCount": 22.0
    },
    {
        "id": "t3_18eil12",
        "createdAt": "2023-12-09T17:34:27.299000+0000",
        "title": "TIL Admiral George Dewey withdrew his candidacy for the 1900 election after he was quoted to have said that being President was easy because he would just follow the orders of Congress",
        "score": 3071.0,
        "commentCount": 30.0
    },
    {
        "id": "t3_18elpvb",
        "createdAt": "2023-12-09T20:01:28.803000+0000",
        "title": "TIL about a device called the beauty micrometer, which was used to measure facial features to determine how much makeup can be used and was invented by beautician Max Factor",
        "score": 159.0,
        "commentCount": 11.0
    },
    {
        "id": "t3_18em8m9",
        "createdAt": "2023-12-09T20:25:40.889000+0000",
        "title": "TIL that the first face seen on a television screen was that of \"Stooky Bill\"—a chalk-white ventriloquist's dummy used by Scottish inventor John Logie Baird for his experiments to transmit a televised image. A dummy was used because the lights of this first TV studio were too hot for humans to bear.",
        "score": 1903.0,
        "commentCount": 59.0
    },
    {
        "id": "t3_18eoae8",
        "createdAt": "2023-12-09T22:03:39.688000+0000",
        "title": "TIL the guy who held the John 3:16 sign at sporting events was arrested for multiple kidnappings and is serving a life sentence.",
        "score": 2365.0,
        "commentCount": 125.0
    },
    {
        "id": "t3_18eolwz",
        "createdAt": "2023-12-09T22:19:09.319000+0000",
        "title": "TIL many Asian countries use fractal-like floor plans to ensure every room gets a window",
        "score": 53.0,
        "commentCount": 9.0
    },
    {
        "id": "t3_18epnbc",
        "createdAt": "2023-12-09T23:09:33.334000+0000",
        "title": "TIL before \"Max\" (Multi Amenity eXpress), a Hitachi and Kawasaki's bullet train, went into retirement after 24 years of service as Japan's last double decker 240km/hr train, it had \"last run\" livery. Train fans and train operator employees bid the 1,634 passenger train farewell, a customary practice",
        "score": 315.0,
        "commentCount": 13.0
    },
    {
        "id": "t3_18epz8i",
        "createdAt": "2023-12-09T23:25:35.302000+0000",
        "title": "TIL that it takes over a week to make a single jelly bean",
        "score": 8264.0,
        "commentCount": 234.0
    },
    {
        "id": "t3_18eq216",
        "createdAt": "2023-12-09T23:29:28.157000+0000",
        "title": "TIL director Michel Gondry found Jim Carrey's emotional state after a breakup \"so beautiful, so broken\" that he asked him to stay that way for one year to fit his character in Eternal Sunshine of the Spotless Mind",
        "score": 7633.0,
        "commentCount": 217.0
    },
    {
        "id": "t3_18er9xt",
        "createdAt": "2023-12-10T00:31:23.189000+0000",
        "title": "Today I learned that ants can theoretically survive a fall from practically any height since an ant falling through the air only has a terminal velocity of about 4 mph.",
        "score": 16664.0,
        "commentCount": 626.0
    },
    {
        "id": "t3_18erpb7",
        "createdAt": "2023-12-10T00:53:48.560000+0000",
        "title": "Til that former middleweight world champion, Carlos ‘Escopeta’ Monzon, finished his 14 year career on an 80 fight unbeaten streak spanning 13 years",
        "score": 467.0,
        "commentCount": 39.0
    },
    {
        "id": "t3_18erqlm",
        "createdAt": "2023-12-10T00:55:41.322000+0000",
        "title": "TIL that prior to electricity, calcium oxide, or quicklime, was used in theaters to light the stage. This is where the term “in the limelight” came from.",
        "score": 1679.0,
        "commentCount": 16.0
    },
    {
        "id": "t3_18eu4z8",
        "createdAt": "2023-12-10T03:09:03.912000+0000",
        "title": "TIL that in 1996 a woman by the name of Georgiana Doerschuck ran for President. Her entire campaign platform was on banning computers. She received a measly 140 votes in the New Hampshire Primary.",
        "score": 3600.0,
        "commentCount": 96.0
    },
    {
        "id": "t3_18eu5su",
        "createdAt": "2023-12-10T03:10:24.979000+0000",
        "title": "TIL that while the Theme from Star Trek does not play its lyrics when Star Trek airs, it does have unheard lyrics written by Gene Rodenberry, the creator of the franchise. As such, the Rodenberry gets paid every time an episode of ST:TOS airs",
        "score": 1145.0,
        "commentCount": 121.0
    },
    {
        "id": "t3_18eupp5",
        "createdAt": "2023-12-10T03:43:30.576000+0000",
        "title": "TIL that in 1960, Sir Edmund Hillary went on an expedition to find evidence of the yeti. He returned with two scraps of fur that locals claimed was “yeti fur,” but was later found to be from the pelt of a rare Tibetan blue bear.",
        "score": 3377.0,
        "commentCount": 24.0
    },
    {
        "id": "t3_18euwfn",
        "createdAt": "2023-12-10T03:54:45.283000+0000",
        "title": "TIL that a Pilot in 1990 was sucked out of the plane window for 20 minutes and survived.",
        "score": 341.0,
        "commentCount": 74.0
    },
    {
        "id": "t3_18ez21i",
        "createdAt": "2023-12-10T08:27:36.151000+0000",
        "title": "TIL the month we are born do have some statistical connection to our health and likeliness of some diseases to manifest.",
        "score": 0.0,
        "commentCount": 64.0
    },
    {
        "id": "t3_18eztbl",
        "createdAt": "2023-12-10T09:23:19.147000+0000",
        "title": "TIL (from an Iggy Pop podcast) that Alan Hale Jr. who played the Skipper on Gilligan's Island went on to open a seafood restaurant and later an agency to book sightseeing cruises.",
        "score": 336.0,
        "commentCount": 35.0
    },
    {
        "id": "t3_18f0w4s",
        "createdAt": "2023-12-10T10:40:19.415000+0000",
        "title": "TIL there’s a dinosaur named Qantassaurus, named in honour of the Australian airline Qantas. This was after Qantas shipped the Great Russian Dinosaurs Exhibit, the largest ever travelling dinosaur exhibit, across the world in the 1990s.",
        "score": 362.0,
        "commentCount": 7.0
    },
    {
        "id": "t3_18f29jd",
        "createdAt": "2023-12-10T12:09:39.985000+0000",
        "title": "TIL: over 600 US planes crashed in a remote region of the Himalayas whilst delivering supplies to Chinese forces over \"the hump\"",
        "score": 5542.0,
        "commentCount": 164.0
    },
    {
        "id": "t3_18f2i2v",
        "createdAt": "2023-12-10T12:24:24.437000+0000",
        "title": "TIL Former British Foreign Secretary Robin Cook wrote that the word Al-Qaeda should be translated as \"the database\", because it originally referred to the computer file of the thousands of mujahideen militants who were recruited and trained with CIA help to defeat the Russians",
        "score": 1617.0,
        "commentCount": 63.0
    },
    {
        "id": "t3_18f4aaf",
        "createdAt": "2023-12-10T14:03:44.366000+0000",
        "title": "TIL of Richard Francis Burton, an 19th century British explorer and writer, who disguised himself as Muslim in order to get into both Mecca and Medina. While he was not the first European to go to either one of those cities, his pilgrimage is the most famous and best documented of the time.",
        "score": 289.0,
        "commentCount": 11.0
    },
    {
        "id": "t3_18f4cq8",
        "createdAt": "2023-12-10T14:07:15.895000+0000",
        "title": "TIL of Dr. Benjamin Spock, a pediatrician whose 1946 book \"Baby and Child Care\" is one of the best-selling books of the twentieth century. His then unconventional advice to parents to show affection to their children and to see them as individuals revolutionized how parents raised their children.",
        "score": 29110.0,
        "commentCount": 1461.0
    },
    {
        "id": "t3_18f4ein",
        "createdAt": "2023-12-10T14:09:51.677000+0000",
        "title": "TIL the director of Captain Phillips didn't allow Tom Hanks and Actors playing somali pirates to meet before filming the movie, so that the pirates can terroize Tom and his crew and create a realistic tension and hostility between them.",
        "score": 7258.0,
        "commentCount": 163.0
    },
    {
        "id": "t3_18f5071",
        "createdAt": "2023-12-10T14:40:53.377000+0000",
        "title": "TIL that cows get most of their proteins by digesting bacteria from their rumen that ended up in their stomach",
        "score": 2699.0,
        "commentCount": 31.0
    },
    {
        "id": "t3_18f69gt",
        "createdAt": "2023-12-10T15:42:00.053000+0000",
        "title": "TIL the revolutionaries behind the 1817 Pernambucan revolt in Brazil planned to bust out Napoleon from his exile on Saint Helena Island and bring him to South America",
        "score": 373.0,
        "commentCount": 16.0
    },
    {
        "id": "t3_18f6we3",
        "createdAt": "2023-12-10T16:12:48.475000+0000",
        "title": "TIL: Mavis Beacon is a fictional character and not a real woman who wanted to teach everyone typing",
        "score": 1335.0,
        "commentCount": 212.0
    },
    {
        "id": "t3_18f7xxj",
        "createdAt": "2023-12-10T17:00:43.547000+0000",
        "title": "TIL: Open Skies is an international treaty signed by 34 nations which allows member states to conduct unarmed surveillance flights over any part of each others territory.",
        "score": 1285.0,
        "commentCount": 67.0
    },
    {
        "id": "t3_18f835z",
        "createdAt": "2023-12-10T17:07:06.509000+0000",
        "title": "TIL Emperor Justinian II (685-695 and 705-711) was overthrown in a rebellion and had his nose cut off to prevent him from ever ruling again. However, he managed to return to power in 705 with a prosthetic gold nose and took his revenge on those who had deposed him.",
        "score": 11581.0,
        "commentCount": 254.0
    },
    {
        "id": "t3_18f97s1",
        "createdAt": "2023-12-10T17:59:18.008000+0000",
        "title": "TIL there are no less than 33 instances of cities and towns named Athens in the world.",
        "score": 124.0,
        "commentCount": 27.0
    },
    {
        "id": "t3_18f9a3j",
        "createdAt": "2023-12-10T18:01:56.366000+0000",
        "title": "TIL a 2018 study concluded the mortality risk for characters in Game of Thrones was high after finding that more than half of the important characters died (186/330 - 56.4%) by the end of Season 7. The chances of a character dying within the first hour that they appear was about 14%.",
        "score": 2484.0,
        "commentCount": 37.0
    },
    {
        "id": "t3_18f9e3x",
        "createdAt": "2023-12-10T18:06:51.522000+0000",
        "title": "TIL Pope John Paul II loved Doc Martens boots so much he gave 100 pairs to Swiss Guards in the Vatican.",
        "score": 3474.0,
        "commentCount": 64.0
    },
    {
        "id": "t3_18fat49",
        "createdAt": "2023-12-10T19:11:13.790000+0000",
        "title": "TIL Apollo 13 astronaut Fred Haise would've have walked on the Moon as commander of Apollo 19 before budget cuts cancelled that flight",
        "score": 4143.0,
        "commentCount": 50.0
    },
    {
        "id": "t3_18fb3wo",
        "createdAt": "2023-12-10T19:24:45.745000+0000",
        "title": "Today I learned that the Tiki Room at Disneyland was originally intended to be a restaurant, and was also the first fully air-conditioned building at Disneyland.",
        "score": 345.0,
        "commentCount": 22.0
    },
    {
        "id": "t3_18fcxuo",
        "createdAt": "2023-12-10T20:45:39.178000+0000",
        "title": "TIL the first cassette single was a mini-album C-30 C-60 C-90 by Bow Wow Wow released in 1980; half of the cassette was intentionally left blank to encourage people to use it to record (pirate) other music",
        "score": 483.0,
        "commentCount": 31.0
    },
    {
        "id": "t3_18ffuwy",
        "createdAt": "2023-12-10T22:56:37.258000+0000",
        "title": "TIL bamboo can grow at a rate of approx. 1m/3ft in just 24 hours",
        "score": 1522.0,
        "commentCount": 121.0
    },
    {
        "id": "t3_18ffx2o",
        "createdAt": "2023-12-10T22:59:29.703000+0000",
        "title": "TIL That judges are more inclined to be lenient with sentencing after a having meal, and in turn, more severe before the break. This is called the Hungry Judge Effect.",
        "score": 4139.0,
        "commentCount": 47.0
    },
    {
        "id": "t3_18fgpj5",
        "createdAt": "2023-12-10T23:37:12.803000+0000",
        "title": "TIL about penitentes, spikes of snow that typically form in high-altitude areas. They can get as tall as 20 feet in the right conditions and are known to be very hard to break.",
        "score": 505.0,
        "commentCount": 9.0
    },
    {
        "id": "t3_18fgzfp",
        "createdAt": "2023-12-10T23:50:48.141000+0000",
        "title": "TIL that Killer Cult leader Charles Manson was a folk musician earlier in his life, and recorded songs.",
        "score": 0.0,
        "commentCount": 43.0
    },
    {
        "id": "t3_18fi32p",
        "createdAt": "2023-12-11T00:45:30.535000+0000",
        "title": "TIL Japan has several \"Nose Tombs\" which contain tens of thousands of severed noses from Korea.",
        "score": 6796.0,
        "commentCount": 670.0
    },
    {
        "id": "t3_18fions",
        "createdAt": "2023-12-11T01:16:22.433000+0000",
        "title": "TIL Final Fantasy: The Spirits Within was a 2001 science fiction film directed by Hironobu Sakaguchi, creator of the Final Fantasy franchise. It was the first photorealistic computer animated feature film, requiring 960 workstations to render the film's 141,964 frames.",
        "score": 747.0,
        "commentCount": 163.0
    },
    {
        "id": "t3_18fjnxr",
        "createdAt": "2023-12-11T02:07:51.160000+0000",
        "title": "TIL The Pontiac Aztek was universally disliked by focus groups. One respondent even said, “I wouldn’t take it as a gift.”. GM continued to press forward with the Aztek’s design despite the negative reception.",
        "score": 22616.0,
        "commentCount": 2298.0
    },
    {
        "id": "t3_18fla4f",
        "createdAt": "2023-12-11T03:33:56.911000+0000",
        "title": "TIL the first Mary Poppins book originally had a chapter where Mary and the children travel around the world and meet racially stereotypical people. This chapter was revised in 1967 to make the characters less offensive, and later revised in 1980 so that they were talking animals instead of humans.",
        "score": 775.0,
        "commentCount": 90.0
    },
    {
        "id": "t3_18flh97",
        "createdAt": "2023-12-11T03:45:12.846000+0000",
        "title": "TIL Tolkien rewrote a small part of Hobbit when he was working on LotR, changed the part about Gollum betting the ring on question game and parting way nicely to getting angry over losing the ring. Because the ring used in LotR was supposed to corrupt the user with greed.",
        "score": 2667.0,
        "commentCount": 60.0
    },
    {
        "id": "t3_18flhdj",
        "createdAt": "2023-12-11T03:45:25.628000+0000",
        "title": "TIL: In 1795, Liberty Hall Academy admitted a student by the name of John Chavis, thereby making him the first African American on record to attend college, and later to become the first to be licensed by the Presbyterian Church in the United States.",
        "score": 105.0,
        "commentCount": 1.0
    },
    {
        "id": "t3_18foi2p",
        "createdAt": "2023-12-11T06:50:09.815000+0000",
        "title": "TIL the \"ALS Icebucket Challenge\" actually raised enough money to create treatments for the disease (that work). It wasn't just a social media trend that went nowhere.",
        "score": 16624.0,
        "commentCount": 363.0
    },
    {
        "id": "t3_18fpdzi",
        "createdAt": "2023-12-11T07:54:41.953000+0000",
        "title": "TIL sugar beets were commercially introduced to Europe as an alternative to Indian sugar canes. As Britain blockaded sugar supplies to whole Europe in early 1800s, a different sugar route was required. During that time, Napoleon ordered in 32,000 hectares of sugar beets to be planted in France.",
        "score": 386.0,
        "commentCount": 14.0
    },
    {
        "id": "t3_18fpyer",
        "createdAt": "2023-12-11T08:35:43.275000+0000",
        "title": "TIL according to Taika Waititi, 80% of the dialogue in Thor: Ragnarok was improvised, in order to create a \"very loose and collaborate mood\" among the cast an attempt to replicate the tone and sensibility from his previous films.",
        "score": 886.0,
        "commentCount": 191.0
    },
    {
        "id": "t3_18fq3r0",
        "createdAt": "2023-12-11T08:46:53.157000+0000",
        "title": "TIL Only 28 books sold more than 500,000 copies in the US in 2022. Eight of them were by romance novelist Colleen Hoover.",
        "score": 7296.0,
        "commentCount": 429.0
    },
    {
        "id": "t3_18fq956",
        "createdAt": "2023-12-11T08:58:17.969000+0000",
        "title": "TIL the Buddha's tribe of origin, the Shakyas, practiced the veneration of trees and sacred groves. Tree veneration remains important in Buddhism today, particularly in the practice of venerating Bodhi (fig) trees, the type of tree that the Buddha eventually attained enlightenment under.",
        "score": 196.0,
        "commentCount": 11.0
    },
    {
        "id": "t3_18fr3ij",
        "createdAt": "2023-12-11T09:57:54.939000+0000",
        "title": "TIL in 2000 the LA Zoo had an issue containing two gorillas, Evelyn & Jim, who were both skilled escapists. Evelyn once used a vine to swing across a 12-ft wide moat to spent 90 min watching giraffes & elephants. Previously she swatted a person's behind. Jim once jumped straight over a 12-ft wall.",
        "score": 2742.0,
        "commentCount": 33.0
    },
    {
        "id": "t3_18fruyy",
        "createdAt": "2023-12-11T10:49:44.946000+0000",
        "title": "TIL that the Barbizon Hotel for Women was a female-only hotel from 1927 to 1981, with a gymnasium, private library, solarium, swimming pool, Turkish bath and organ recitals. Patrons were mainly artists and included Sylvia Plath, Grace Kelly and Liza Minnelli",
        "score": 341.0,
        "commentCount": 22.0
    },
    {
        "id": "t3_18fsln2",
        "createdAt": "2023-12-11T11:37:34.120000+0000",
        "title": "TIL that around 1226, a Vietnamese prince fled Vietnam with a large number of servants. He ended up in Korea, where King Kojong of the Goryeo Dynasty welcomed him. Today about 600 households in South Korea can trace their ancestry to him",
        "score": 487.0,
        "commentCount": 21.0
    },
    {
        "id": "t3_18ftps4",
        "createdAt": "2023-12-11T12:43:53.738000+0000",
        "title": "TIL Edward Neumeier turned down a promotion to Vice-President at Universal Pictures so he could finish the RoboCop screenplay with Michael Miner",
        "score": 206.0,
        "commentCount": 7.0
    },
    {
        "id": "t3_18fttxs",
        "createdAt": "2023-12-11T12:50:20.546000+0000",
        "title": "TIL Australia has a forger on their ten dollar note.",
        "score": 151.0,
        "commentCount": 18.0
    },
    {
        "id": "t3_18fu6st",
        "createdAt": "2023-12-11T13:09:16.806000+0000",
        "title": "TIL The space probe Juno was unable to make use of its Jovian Infrared Auroral Mapper (JIRAM) instrument during its first otherwise successful close flyby of Jupiter due to it being offline awaiting a software update.",
        "score": 1208.0,
        "commentCount": 11.0
    },
    {
        "id": "t3_18fv79y",
        "createdAt": "2023-12-11T14:01:21.941000+0000",
        "title": "TIL Po from Teletubbies is bilingual in Cantonese",
        "score": 101.0,
        "commentCount": 16.0
    },
    {
        "id": "t3_18fvh1f",
        "createdAt": "2023-12-11T14:14:23.585000+0000",
        "title": "TIL George Michael's ''A different Corner\" was the first British No.1 hit song on UK chart that an artist wrote, sang, arranged, produced, and played all the instruments on the song all by himself.",
        "score": 112.0,
        "commentCount": 0.0
    },
    {
        "id": "t3_18fwigl",
        "createdAt": "2023-12-11T15:02:37.529000+0000",
        "title": "TIL the US private security/detective agency, Pinkerton, sued Rockstar Games and Take-Two Interactive in 2019, for using Pinkerton’s trademark and portraying their agents as antagonists in Red Dead Redemption 2. Take-Two counter-sued on the grounds of fair use.",
        "score": 14923.0,
        "commentCount": 496.0
    },
    {
        "id": "t3_18fx0fy",
        "createdAt": "2023-12-11T15:24:58.946000+0000",
        "title": "TIL in 1965, Air India airlines commissioned Salvador Dali to design an ashtray for the airlines. Dali requested an elephant as fees so the airline flew a two year old elephant from Bangalore to Geneva. After Dali lost interest, the elephant was taken to the Barcelona Zoo in 1971.",
        "score": 7799.0,
        "commentCount": 113.0
    },
    {
        "id": "t3_18fymj9",
        "createdAt": "2023-12-11T16:35:13.703000+0000",
        "title": "TIL there is no evidence that Viking had horned helmets. Their depiction with horned helmets is a fallacy that began in the 1870s.",
        "score": 2542.0,
        "commentCount": 79.0
    },
    {
        "id": "t3_18g02do",
        "createdAt": "2023-12-11T18:03:41.113000+0000",
        "title": "TIL McDonald’s was accused of using NORAID to covertly fund the Provisional IRA. The source of these rumors was eventually traced to a CNN talk show that praised NORAID for its generous IRAs.",
        "score": 2076.0,
        "commentCount": 58.0
    },
    {
        "id": "t3_18g0h7q",
        "createdAt": "2023-12-11T18:34:33.901000+0000",
        "title": "TIL Novelist Michael Crichton was a hobbyist computer programmer in the 1980s, and helped program his own adaptation of Congo for the Commodore 64 ... which then had to be rebranded after realizing he had already sold the adaptation rights to the book.",
        "score": 445.0,
        "commentCount": 22.0
    },
    {
        "id": "t3_18g15oy",
        "createdAt": "2023-12-11T19:01:58.616000+0000",
        "title": "TIL that in 1987, Nintendo released a 3D system for the Famicom. The system used shutter glasses to create an illusion of depth. While the effect worked, the system was a commercial failure, and only seven games were released for it.",
        "score": 359.0,
        "commentCount": 27.0
    },
    {
        "id": "t3_18g1h3i",
        "createdAt": "2023-12-11T19:14:54.587000+0000",
        "title": "TIL John Lennon didn't sign paperwork for the the dissolution of the Beatles until December 1974, while he was at the at the Disney World Polynesian Resort in Florida.",
        "score": 200.0,
        "commentCount": 16.0
    },
    {
        "id": "t3_18g1y1p",
        "createdAt": "2023-12-11T19:33:46.802000+0000",
        "title": "TIL there are 7 states where its legal to own a pet bear",
        "score": 515.0,
        "commentCount": 106.0
    },
    {
        "id": "t3_18g40mx",
        "createdAt": "2023-12-11T20:58:15.453000+0000",
        "title": "TIL the wind-powered land speed world record was set by a vehicle traveling nearly 6 times the speed of the wind.",
        "score": 2927.0,
        "commentCount": 81.0
    },
    {
        "id": "t3_18g4oju",
        "createdAt": "2023-12-11T21:25:19.824000+0000",
        "title": "TIL an Australian woman on a work trip received compensation for injuries received when a light fitting fell on her whilst having sex",
        "score": 925.0,
        "commentCount": 83.0
    },
    {
        "id": "t3_18g4u8y",
        "createdAt": "2023-12-11T21:31:33.105000+0000",
        "title": "TIL that Benito Mussolini denounced the Catholic Church for \"its authoritarianism and refusal to allow freedom of thought ...\"",
        "score": 4191.0,
        "commentCount": 296.0
    },
    {
        "id": "t3_18g5xdg",
        "createdAt": "2023-12-11T22:15:49.486000+0000",
        "title": "TIL that legendary baseball star Ichiro Suzuki once refused to tell the media the name of his dog because he, “didn’t have the dog’s permission”. He also credited his dog for convincing him to stay with his longtime team, the Seattle Mariners.",
        "score": 12610.0,
        "commentCount": 214.0
    },
    {
        "id": "t3_18g6k0w",
        "createdAt": "2023-12-11T22:42:23.463000+0000",
        "title": "TIL that the Soviet spacecraft Luna 1 was intended to be the first craft to land on the moon. It missed the moon by nearly 6000km and ended up becoming the first spacecraft to enter orbit around the sun between the orbits of Earth and Mars.",
        "score": 8185.0,
        "commentCount": 161.0
    },
    {
        "id": "t3_18g6ke5",
        "createdAt": "2023-12-11T22:42:48.423000+0000",
        "title": "TIL Walmart has more revenue than Amazon, Saudi Aramco, and has been the largest company by revenue since 2014.",
        "score": 2169.0,
        "commentCount": 156.0
    },
    {
        "id": "t3_18g6tx2",
        "createdAt": "2023-12-11T22:53:58.439000+0000",
        "title": "TIL that Kieran Culkin, brother of Macaulay, was cast as Ralphie Parker in a 1994 sequel to A Christmas Story, called \"My Summer Story\".",
        "score": 116.0,
        "commentCount": 12.0
    },
    {
        "id": "t3_18g6z5q",
        "createdAt": "2023-12-11T23:00:26.494000+0000",
        "title": "TIL Persipan is a cheaper substitute for almond-derived marzipan, and is made from the kernels of either peaches or apricots. It is commonly used to make German Stollen pastries. However, amygdalin must be removed from the kernels before use, as this compound causes cyanide poisoning!",
        "score": 330.0,
        "commentCount": 17.0
    },
    {
        "id": "t3_18g7jeg",
        "createdAt": "2023-12-11T23:25:11.416000+0000",
        "title": "TIL Jerry Lee Lewis' son used to offer tours of his ranch in Mississippi by appointment. The \"Killer\" stayed in a senior community and reopened his home as a rock n roll museum in 2017 for his fans",
        "score": 735.0,
        "commentCount": 22.0
    },
    {
        "id": "t3_18g91ik",
        "createdAt": "2023-12-12T00:35:41.567000+0000",
        "title": "TIL that Robert Ballard, best known for his discovery of the wreck of the Titanic, also uncovered the Battleship Bismarck, the aircraft carrier Yorktown and John F. Kennedy’s PT-109. He also tried yet unfortunately failed to find Amelia Earharts plane.",
        "score": 2657.0,
        "commentCount": 97.0
    },
    {
        "id": "t3_18gahcw",
        "createdAt": "2023-12-12T01:48:25.539000+0000",
        "title": "TIL The Hollywood sign was rebuilt after a successful campaign in 1978 by Alice Cooper. He was one of 9 donators to replace each letter. He bought the first \"O\" in memory of Groucho Marx.",
        "score": 6400.0,
        "commentCount": 137.0
    },
    {
        "id": "t3_18gb7nm",
        "createdAt": "2023-12-12T02:24:37.094000+0000",
        "title": "Today I learned that in July 2014, when Morgan Freeman learned about declining honeybee populations, he turned his 124-acre ranch into a bee sanctuary.",
        "score": 2814.0,
        "commentCount": 53.0
    },
    {
        "id": "t3_18gcw80",
        "createdAt": "2023-12-12T03:53:04.886000+0000",
        "title": "TIL that Sea turtles have a natural lifespan of up to 100 years",
        "score": 297.0,
        "commentCount": 23.0
    },
    {
        "id": "t3_18geyar",
        "createdAt": "2023-12-12T05:48:54.158000+0000",
        "title": "TIL that Vitol, a Swiss-based Dutch energy trading company's revenue per worker is 323 million dollars.",
        "score": 174.0,
        "commentCount": 24.0
    },
    {
        "id": "t3_18gfv0a",
        "createdAt": "2023-12-12T06:46:28.733000+0000",
        "title": "TIL the Isabelline (Spain), Manueline (Portugal), Perpendicular (UK), and Sondergotik (what is now Germany, Austria, Switzerland and parts of central Europe) architectural styles are variants of the Flamboyant Gothic (France, Belgium), which featured abstract webs of stone lattice and ornamentation",
        "score": 65.0,
        "commentCount": 2.0
    },
    {
        "id": "t3_18gfxv4",
        "createdAt": "2023-12-12T06:51:44.256000+0000",
        "title": "TIL Bananas are one of the most radioactive foods. And there is a unit of radiation called BED (Banana Equivalence Dose)",
        "score": 1126.0,
        "commentCount": 52.0
    },
    {
        "id": "t3_18gho3m",
        "createdAt": "2023-12-12T08:57:49.191000+0000",
        "title": "TIL: There is a De extinction task force established in 2014 by the Species Survival Commission whose purpose is to identify suitable animals to bring back that would not harm humans and can thrive. The three methods currently employed are cloning, genome engineering, and back breeding.",
        "score": 3401.0,
        "commentCount": 66.0
    },
    {
        "id": "t3_18ghpoe",
        "createdAt": "2023-12-12T09:00:58.661000+0000",
        "title": "TIL a church in Madeira Beach, Florida has become a tourist attraction for it's architecture which resembles a cartoon chicken, often referred to as the \"Angry Birds church\"",
        "score": 281.0,
        "commentCount": 19.0
    },
    {
        "id": "t3_18gicmq",
        "createdAt": "2023-12-12T09:49:06.138000+0000",
        "title": "TIL Maria Guyomar de Pinha is known in Thailand for having introduced Portuguese-influenced desserts, including the golden egg threads (\"foi thong\")",
        "score": 75.0,
        "commentCount": 2.0
    },
    {
        "id": "t3_18gjwlz",
        "createdAt": "2023-12-12T11:34:05.290000+0000",
        "title": "TIL about Derinkuyu (modern day Turkey), a 3000 year old underground city that once housed up to 20000 people and their livestock",
        "score": 3043.0,
        "commentCount": 89.0
    },
    {
        "id": "t3_18gkm1t",
        "createdAt": "2023-12-12T12:18:16.028000+0000",
        "title": "TIL about the Battle of Saragarhi. It was a last-stand battle fought before the Tirah Campaign between the British Raj and Afghan tribesmen. 21 Sikh soldiers in an outpost—refused to surrender and were wiped out in a last stand, while fighting against an estimated number of 10,000 to 12,000.",
        "score": 110.0,
        "commentCount": 7.0
    },
    {
        "id": "t3_18gl7e5",
        "createdAt": "2023-12-12T12:53:09.237000+0000",
        "title": "TIL that the card game Rook was created in 1906 as an alternative to standard playing cards for Mennonite and Puritan communities. These cards were also known as missionary cards.",
        "score": 231.0,
        "commentCount": 39.0
    },
    {
        "id": "t3_18gmh6d",
        "createdAt": "2023-12-12T13:58:56.397000+0000",
        "title": "TIL that in a survey of 500 law firm workers, over 50% confirmed that legal TV shows had influenced their career choice & 57% of those felt that the TV series that impacted them was a \"realistic depiction of a legal career.\" 30% identified Suits as their show, 22% said Law and Order.",
        "score": 15165.0,
        "commentCount": 937.0
    },
    {
        "id": "t3_18gnl70",
        "createdAt": "2023-12-12T14:50:19.263000+0000",
        "title": "TIL that the Knights Hospitallers colonized four islands in the Caribbean",
        "score": 412.0,
        "commentCount": 15.0
    },
    {
        "id": "t3_18gnqyq",
        "createdAt": "2023-12-12T14:57:42.183000+0000",
        "title": "TIL Silent Night is the world's most recorded Christmas song, with more than 137,000 known recordings!",
        "score": 173.0,
        "commentCount": 24.0
    },
    {
        "id": "t3_18gnz59",
        "createdAt": "2023-12-12T15:07:19.354000+0000",
        "title": "TIL in 1965, the gun that killed Vincent Van Gogh was found in a field outside Auvers-sur-Oise, France by a farmer. It had lay where it fell from the artist’s hands 75 years before. It went on to sell at auction for $182,000",
        "score": 10242.0,
        "commentCount": 190.0
    },
    {
        "id": "t3_18gqz1e",
        "createdAt": "2023-12-12T17:15:44.405000+0000",
        "title": "TIL President Johnson (LBJ) was almost beaten with a tire iron for trying to trick black people into opening a trunk full of snakes",
        "score": 16483.0,
        "commentCount": 1125.0
    },
    {
        "id": "t3_18gsxb4",
        "createdAt": "2023-12-12T18:38:24.515000+0000",
        "title": "TIL different colored bell peppers are still the same species. Red bell peppers are merely the ripened form of green bell peppers",
        "score": 158.0,
        "commentCount": 36.0
    },
    {
        "id": "t3_18gt1gm",
        "createdAt": "2023-12-12T18:43:05.596000+0000",
        "title": "TIL about Balloonfest '86 in Cleveland, where 1.5 million balloons were released, to disastrous results",
        "score": 174.0,
        "commentCount": 11.0
    },
    {
        "id": "t3_18gtc7v",
        "createdAt": "2023-12-12T18:55:45.001000+0000",
        "title": "TIL Weezers “Buddy Holly” music video was included on the Windows 95 installation CD without the bands prior permission",
        "score": 3513.0,
        "commentCount": 297.0
    },
    {
        "id": "t3_18gtczw",
        "createdAt": "2023-12-12T18:56:42.161000+0000",
        "title": "TIL that although it's commonly believed that we can feel stares, studies on the Psychic Staring Effect have repeatedly produced results no better than random chance.",
        "score": 4290.0,
        "commentCount": 198.0
    },
    {
        "id": "t3_18gud27",
        "createdAt": "2023-12-12T19:39:02.159000+0000",
        "title": "TIL about Lampreia de Ovos, a sweet portuguese dessert in the form of a Lamprey made with egg yolks and sugar, the form it's in reference to the fact that lampreys are so consumed during lent.",
        "score": 67.0,
        "commentCount": 12.0
    },
    {
        "id": "t3_18gv8t7",
        "createdAt": "2023-12-12T20:16:27.143000+0000",
        "title": "TIL: There are virtually zero commercial planes that fly over Tibet, one of the reasons being that in the event of depressurization/engine failure, planes cannot descend to 10,000 feet because the Tibetan Plateau has an average elevation of 14,370 feet.",
        "score": 5631.0,
        "commentCount": 105.0
    },
    {
        "id": "t3_18gvfnm",
        "createdAt": "2023-12-12T20:24:37.433000+0000",
        "title": "TIL America was almost named “Amerige” meaning “Land of Amerigo”, but was changed to the feminine form America, following the naming convention of Asia and Europe.",
        "score": 7876.0,
        "commentCount": 246.0
    },
    {
        "id": "t3_18gw25v",
        "createdAt": "2023-12-12T20:51:49.059000+0000",
        "title": "TIL about the 1942-1944 Musician's Strike. During that period, union musicians refused to record new music. It's still the longest strike in the history of the entertainment industry",
        "score": 254.0,
        "commentCount": 9.0
    },
    {
        "id": "t3_18gw8do",
        "createdAt": "2023-12-12T20:59:26.811000+0000",
        "title": "TIL Abercrombie & Fitch’s \"Appearance/Look Policy\" required staff to buy the company’s clothes. After losing a lawsuit, they agreed \"not to force workers to buy its clothes\" and to reimburse former employees for purchases made during the period cited.",
        "score": 7482.0,
        "commentCount": 197.0
    },
    {
        "id": "t3_18gwawb",
        "createdAt": "2023-12-12T21:02:14.624000+0000",
        "title": "TIL nuclear test Ruth performed so poorly that it only partially damaged the tower on which it was detonated",
        "score": 923.0,
        "commentCount": 32.0
    },
    {
        "id": "t3_18gwcet",
        "createdAt": "2023-12-12T21:04:00.087000+0000",
        "title": "TIL the creator of the infamous \"Impossible is Nothing\" resume video died of a drug overdose in 2013",
        "score": 3305.0,
        "commentCount": 54.0
    },
    {
        "id": "t3_18gwdog",
        "createdAt": "2023-12-12T21:05:27.558000+0000",
        "title": "TIL Nunavut is the least densely populated major country sub-division in the world (not considering Antarctica), being even less densely populated than Denmark's Greenland.",
        "score": 451.0,
        "commentCount": 34.0
    },
    {
        "id": "t3_18gwm4l",
        "createdAt": "2023-12-12T21:15:39.502000+0000",
        "title": "TIL Rock guitar icon Duane Allman only started playing guitar 14, slide guitar at 22 and tragically died at 24. In 2003, he was ranked number 2 in Rolling Stone magazine's list of the 100 greatest guitarists of all time, second only to Jimi Hendrix.",
        "score": 1058.0,
        "commentCount": 198.0
    },
    {
        "id": "t3_18gxbtp",
        "createdAt": "2023-12-12T21:45:30.331000+0000",
        "title": "TIL - The severed head of Mata Hari was embalmed and kept in the Museum of Anatomy in Paris. In 2000, archivists discovered that it had disappeared",
        "score": 6616.0,
        "commentCount": 177.0
    },
    {
        "id": "t3_18gz2sd",
        "createdAt": "2023-12-12T22:41:55.288000+0000",
        "title": "TIL about Pope John Paul II’s “Theology of the Body,” a series of 129 lectures that laid the foundation for modern evangelical views on celibacy, virginity, marriage, and sexuality",
        "score": 398.0,
        "commentCount": 45.0
    },
    {
        "id": "t3_18gzcb9",
        "createdAt": "2023-12-12T22:49:54.578000+0000",
        "title": "TIL that in 2003, more than 20 people were killed in Iraq in a single day by bullets returning to earth from celebratory gunfire. They were celebrating the death of Saddam Hussein's sons.",
        "score": 1685.0,
        "commentCount": 37.0
    },
    {
        "id": "t3_18gzvj1",
        "createdAt": "2023-12-12T23:05:29.568000+0000",
        "title": "TIL in 1923, the United State's Post Office Department mandated that every household have a mailbox or letter slot to receive mail. Before that, letter carriers knocked on the door and waited for people to answer.",
        "score": 8020.0,
        "commentCount": 197.0
    },
    {
        "id": "t3_18h2aod",
        "createdAt": "2023-12-13T00:20:15.075000+0000",
        "title": "TIL the best selling single model year vehicle in American history is the 1965 Chevrolet Impala. 1,074,925 units in one year a record yet to be broken. 200K of those vehicles having the SS package.",
        "score": 13010.0,
        "commentCount": 369.0
    },
    {
        "id": "t3_18h2wn3",
        "createdAt": "2023-12-13T00:39:01.133000+0000",
        "title": "TIL that (according to a survey) over 50% of workers fear being fired more than death, and 65% fear it more than sickness/poor health",
        "score": 2042.0,
        "commentCount": 106.0
    },
    {
        "id": "t3_18h381p",
        "createdAt": "2023-12-13T00:49:07.508000+0000",
        "title": "TIL The Neo Geo is the most expensive home video game console ever made, selling for $650 in 1990. That's $1,566.59 today. It was originally supposed to be a rental console but was sold for retail due to high demand.",
        "score": 3123.0,
        "commentCount": 248.0
    },
    {
        "id": "t3_18h3o5y",
        "createdAt": "2023-12-13T01:03:27.356000+0000",
        "title": "TIL the music video for Cher’s “If I Could Turn Back Time” was filmed on the battleship USS Missouri. The revealing outfit she wore caused considerable controversy, with WWII veterans saying it desecrated a historic site",
        "score": 2041.0,
        "commentCount": 206.0
    },
    {
        "id": "t3_18h69e7",
        "createdAt": "2023-12-13T02:30:37.277000+0000",
        "title": "TIL, on December 12, 1988 three trains were involved in a collision at the Clapham Junction railway station in London. 35 people were killed and 484 were injured.",
        "score": 83.0,
        "commentCount": 6.0
    },
    {
        "id": "t3_18h79ce",
        "createdAt": "2023-12-13T03:20:08.561000+0000",
        "title": "TIL that Coral reefs are made of the skeletons of coral animals, which live in symbiosis with microorganisms to form colorful marine ecosystems.",
        "score": 273.0,
        "commentCount": 10.0
    },
    {
        "id": "t3_18h79uz",
        "createdAt": "2023-12-13T03:20:53.287000+0000",
        "title": "TIL there is a special airline just for horses nicknamed, Air Horse One",
        "score": 1956.0,
        "commentCount": 54.0
    },
    {
        "id": "t3_18h7kiv",
        "createdAt": "2023-12-13T03:35:56.258000+0000",
        "title": "TIL that the U.S. has 41 \"independent cities\", which aren't in the territory of any county. Of these, 38 of them are in Virginia.",
        "score": 1282.0,
        "commentCount": 269.0
    },
    {
        "id": "t3_18ha5t7",
        "createdAt": "2023-12-13T06:03:17.873000+0000",
        "title": "TIL I learned the famous 1993 Got Milk ad about a radio contest on who shot Alexander Hamilton was not only the first in the Got Milk campaign but was directed by Michael Bay.",
        "score": 170.0,
        "commentCount": 23.0
    },
    {
        "id": "t3_18hcz2w",
        "createdAt": "2023-12-13T09:22:36.401000+0000",
        "title": "Today I learned that 'Frostbit Boy' was rescued from the ocean in 2021 after being in the water 12 hours, discovered surrounded by a pod of dolphins.",
        "score": 1879.0,
        "commentCount": 37.0
    },
    {
        "id": "t3_18hecrf",
        "createdAt": "2023-12-13T11:01:06.984000+0000",
        "title": "TIL scientists for the first time in \"significant detail\" captured footage of orcas hunting & killing great white sharks via first-time ever aerial footage of the behavior in South Africa. Researchers recorded 11 shark deaths by orcas. Evidence also suggested the hunting was becoming more common.",
        "score": 11041.0,
        "commentCount": 398.0
    },
    {
        "id": "t3_18henrw",
        "createdAt": "2023-12-13T11:21:17.228000+0000",
        "title": "TIL that in 1940, there were German-Soviet Axis talks where Hitler and Stalin discussed the possibility of the Soviet Union joining the Axis powers, but the negotiations ultimately failed.",
        "score": 3586.0,
        "commentCount": 520.0
    },
    {
        "id": "t3_18hg943",
        "createdAt": "2023-12-13T12:59:04.577000+0000",
        "title": "TIL about Jim Rice, who in 1982 rushed the stands to help a 4 year old boy that was struck in the head by a line drive off the bat. Rice carried the boy onto the field, through the Red Sox dugout and into the clubhouse, where he was treated immediately. Jim's swift response saved the boy's life.",
        "score": 7839.0,
        "commentCount": 183.0
    },
    {
        "id": "t3_18hi6dx",
        "createdAt": "2023-12-13T14:36:42.497000+0000",
        "title": "TIL that Despot, Tyrant, Dictator, and Autocrat were originally respectable titles and did not have the negative connotations we do today",
        "score": 1206.0,
        "commentCount": 98.0
    },
    {
        "id": "t3_18hiwut",
        "createdAt": "2023-12-13T15:10:27.346000+0000",
        "title": "TIL the RAF banned marshmallows because they could explode.",
        "score": 3756.0,
        "commentCount": 87.0
    },
    {
        "id": "t3_18hk3uj",
        "createdAt": "2023-12-13T16:03:54.477000+0000",
        "title": "TIL The Supremes once promoted their own brand of bread: white bread.",
        "score": 350.0,
        "commentCount": 18.0
    },
    {
        "id": "t3_18hkae3",
        "createdAt": "2023-12-13T16:12:03.694000+0000",
        "title": "TIL the longest prison sentence ever given was 141,078 years, given to a Thai woman in 1989. She was released 4 years later.",
        "score": 6266.0,
        "commentCount": 197.0
    },
    {
        "id": "t3_18hkd45",
        "createdAt": "2023-12-13T16:15:28.387000+0000",
        "title": "TIL in 2014, Christos Papadimitriou, a famous theoretical computer scientist, said about modern CS education that “the courses have become so complicated that I doubt I could pass them!”",
        "score": 9248.0,
        "commentCount": 256.0
    },
    {
        "id": "t3_18hl3iy",
        "createdAt": "2023-12-13T16:47:51.052000+0000",
        "title": "TIL that the book \"Fluid Concepts and Creative Analogies: Computer Models of the Fundamental Mechanisms of Thought\" by Douglas Hofstadter was the first book sold on Amazon",
        "score": 86.0,
        "commentCount": 11.0
    },
    {
        "id": "t3_18hl8jk",
        "createdAt": "2023-12-13T16:53:40.433000+0000",
        "title": "TIL Kerry Livgren from the band Kansas wrote the guitar for Dust in the wind as an exercise for learning travis picking and was hesitant to show his bandmates the song because he thought they would not like the song because it was so different from their previous material.",
        "score": 137.0,
        "commentCount": 32.0
    },
    {
        "id": "t3_18hlvn4",
        "createdAt": "2023-12-13T17:20:02.344000+0000",
        "title": "TIL That A-List Celebrities are 2x More Likely to Divorce in the First 14 Years of Marriage",
        "score": 2064.0,
        "commentCount": 125.0
    },
    {
        "id": "t3_18hmsyj",
        "createdAt": "2023-12-13T17:58:33.329000+0000",
        "title": "Til of the Arc of Neutrality, a 75 meter tall monument in Ashgabat, Turkmenistan. Built in 1998, it commemorated the recognition of the UN that Turkmenistan was a neutral country. It featured a 12 meter tall golden statue of President Saparmyrat Nyýazow which rotated to always face the sun.",
        "score": 210.0,
        "commentCount": 20.0
    },
    {
        "id": "t3_18hnrcs",
        "createdAt": "2023-12-13T18:38:50.588000+0000",
        "title": "TIL Amazon River Dolphins are the only known species to have been observed having \"nasal sex\", i.e. penetration of the blowhole.",
        "score": 1135.0,
        "commentCount": 148.0
    },
    {
        "id": "t3_18ho5xm",
        "createdAt": "2023-12-13T18:56:14.871000+0000",
        "title": "TIL that when the NHL Stanley Cup runs out space for engravings, the oldest engraved band is removed and a new one is added. Most recently, the winners from 1954 to 1965 were removed.",
        "score": 15798.0,
        "commentCount": 753.0
    },
    {
        "id": "t3_18hr02f",
        "createdAt": "2023-12-13T20:58:24.741000+0000",
        "title": "TIL talking about suicide actually reduces the risk of suicide rather than causing it.",
        "score": 3296.0,
        "commentCount": 147.0
    },
    {
        "id": "t3_18hr9jv",
        "createdAt": "2023-12-13T21:09:35.881000+0000",
        "title": "TIL that Thomas Cornell was convicted and sent to the gallows for the 1673 murder of his mother, due in part to \"spectral evidence\" presented by his uncle, who said her ghost paid him a visit and told him that Thomas did it.",
        "score": 7053.0,
        "commentCount": 170.0
    },
    {
        "id": "t3_18hrgat",
        "createdAt": "2023-12-13T21:17:40.021000+0000",
        "title": "TIL about \"Cuberdons\", a belgian confection made of sugar, jam and candy shell that one time in 2011, sparked a war between two sellers that end with violence and both licences revoked.",
        "score": 54.0,
        "commentCount": 0.0
    },
    {
        "id": "t3_18hshmw",
        "createdAt": "2023-12-13T22:02:52.004000+0000",
        "title": "TIL in the right conditions a lake can freeze with clear ice which you can see through to the bottom. When it freezes very slowly it forms larger crystals which are clearer. As water freezes its density changes, and if that happens quickly minute cracks in the stressed ice will make it look clouded",
        "score": 585.0,
        "commentCount": 13.0
    },
    {
        "id": "t3_18ht4o1",
        "createdAt": "2023-12-13T22:29:42.062000+0000",
        "title": "TIL that even though Ms. Pac-Man was Pac-Man's wife, the creators chose the name Ms. rather than Mrs. because it was easier to pronounce",
        "score": 627.0,
        "commentCount": 78.0
    },
    {
        "id": "t3_18htsfb",
        "createdAt": "2023-12-13T22:58:24.323000+0000",
        "title": "TIL the smallest international exclave is a single German house surrounded by Belgium on all sides.",
        "score": 1152.0,
        "commentCount": 25.0
    },
    {
        "id": "t3_18hu6tm",
        "createdAt": "2023-12-13T23:15:33.085000+0000",
        "title": "TIL that the Highlander Research and Education Center in New Market, TN has served as a center for labor rights, civil rights and social justice work since 1932. MLK and Rosa Parks spent time at the center. The center is still open and focuses on democratic participation and economic justice.",
        "score": 180.0,
        "commentCount": 8.0
    },
    {
        "id": "t3_18humu5",
        "createdAt": "2023-12-13T23:35:35.737000+0000",
        "title": "TIL That Throughout The 1950’s And 60’s Car Manufacturers Developed A Turbine Engine That Was Capable Of Running Any Type Of Fuel Without Modification. As A Demonstration The Car Was Driven To Mexico Powered by Tequila. In France It Was Powered By Chanel No. 5",
        "score": 16394.0,
        "commentCount": 697.0
    },
    {
        "id": "t3_18hupk4",
        "createdAt": "2023-12-13T23:39:07.951000+0000",
        "title": "TIL that the Andromeda galaxy is approaching the Milky Way at a speed faster than a bullet, so it will end up colliding with it in about 4 billion years",
        "score": 111.0,
        "commentCount": 104.0
    },
    {
        "id": "t3_18hw1r5",
        "createdAt": "2023-12-14T00:42:29.177000+0000",
        "title": "TIL that in 1983, Belarus-born immigrant Rose Blumkin sold her successful discount furniture and electronics emporium to an admirer named Warren Buffett. She was 89. Six years later, Blumkin got bored and started a carpet outlet business that was soon profitable enough that Buffett bought that, too.",
        "score": 213.0,
        "commentCount": 14.0
    },
    {
        "id": "t3_18hwgw1",
        "createdAt": "2023-12-14T01:02:41.160000+0000",
        "title": "TIL of Vincent Kosuga who in 1956 was able to successfully corner the Chicago onion market and made a fortune controlling 98% of all onions traded on the exchange.",
        "score": 5888.0,
        "commentCount": 107.0
    },
    {
        "id": "t3_18hxa53",
        "createdAt": "2023-12-14T01:43:17.589000+0000",
        "title": "TIL that there are multiple levels of hyperparasites, specifically a fungus on a fungus on a fungus on a tree.",
        "score": 2492.0,
        "commentCount": 33.0
    },
    {
        "id": "t3_18hyqz4",
        "createdAt": "2023-12-14T02:58:42.766000+0000",
        "title": "TIL that there was a restaurant chain called Sambo's that decorated with pictures from the infamous book. The name generated protests starting in the 1970, but its last remaining location only changed it's name in 2020.",
        "score": 1192.0,
        "commentCount": 257.0
    },
    {
        "id": "t3_18hyrp1",
        "createdAt": "2023-12-14T02:59:48.502000+0000",
        "title": "TIL in 2008 for a perfume ad P. Diddy filmed and published an audition tape to nominate himself as the next James Bond",
        "score": 12.0,
        "commentCount": 14.0
    },
    {
        "id": "t3_18hz3xe",
        "createdAt": "2023-12-14T03:17:30.399000+0000",
        "title": "TIL - Over 60% of the Netherlands is vulnerable to flooding since about 50% of the country's land lies less than 1 meter above sea level. So the Dutch have engineered an intricate system of dykes, canals, dams and seawalls to reclaim land and block coastal waters.",
        "score": 967.0,
        "commentCount": 118.0
    },
    {
        "id": "t3_18hz4f0",
        "createdAt": "2023-12-14T03:18:15.757000+0000",
        "title": "TIL that Elephant gestation period longer than any living mammal. African elephants are pregnant for an average of 22 months, whilst for Asian elephants it's 18 to 22 months.",
        "score": 2683.0,
        "commentCount": 42.0
    },
    {
        "id": "t3_18hz56j",
        "createdAt": "2023-12-14T03:19:30.201000+0000",
        "title": "TIL sound engineer Greg P. Russell has received 16 Academy Award nominations for Best Sound Mixing and has never won",
        "score": 211.0,
        "commentCount": 8.0
    },
    {
        "id": "t3_18hz7jt",
        "createdAt": "2023-12-14T03:22:54.826000+0000",
        "title": "TIL - Whale sharks, despite being enormous in size, sustain themselves by filtering and eating tiny plankton through their gill rakers. Their mouths can contain up to 350 rows of these tiny filters!",
        "score": 238.0,
        "commentCount": 17.0
    },
    {
        "id": "t3_18i064f",
        "createdAt": "2023-12-14T04:15:51.776000+0000",
        "title": "TIL, that one of the largest owners of Stradivarius instruments in the world is the Japanese government, via the Nippon Music Foundation. They own 19 Stradivarius instruments and even loan them to musicians.",
        "score": 361.0,
        "commentCount": 18.0
    },
    {
        "id": "t3_18i2x6h",
        "createdAt": "2023-12-14T07:03:31.704000+0000",
        "title": "TIL Until the late 1990s, China was a nation of cyclists. In the 1970–80s, bicycles, together with watch and sewing machines, was a must-have item for marriage",
        "score": 418.0,
        "commentCount": 27.0
    },
    {
        "id": "t3_18i32zj",
        "createdAt": "2023-12-14T07:15:22.957000+0000",
        "title": "TIL the smoke detector was accidentally invented in the 1930s by Swiss physicist Walter Jaeger. While he was trying to come up with a sensor that would identify poison gas, Jaeger's device instead registered his cigarette smoke.",
        "score": 1631.0,
        "commentCount": 49.0
    },
    {
        "id": "t3_18i4pj2",
        "createdAt": "2023-12-14T09:14:36.582000+0000",
        "title": "TIL the power of friendship was an important factor in humanity becoming the world’s most dominant species as well as domesticating dogs",
        "score": 903.0,
        "commentCount": 47.0
    },
    {
        "id": "t3_18i51e7",
        "createdAt": "2023-12-14T09:38:26.958000+0000",
        "title": "TIL of the \"Blue Banana\" - a geographical region stretching \"like a banana\" from Northern Italy, across western Germany & the Low Countries into England's Liverpool region. The area is believed by some to constitue the industrial and economic \"backbone\" of Europe, both presently and in history",
        "score": 3112.0,
        "commentCount": 222.0
    },
    {
        "id": "t3_18i55tm",
        "createdAt": "2023-12-14T09:47:25.003000+0000",
        "title": "TIL fossilized remains of a cat-sized mammal (Repenomamus robustus) biting down on a beaked dinosaur's ribcage (Psittacosaurus lujiatunensis) were discovered in China. A wave of ash and mud from a nearby volcanic eruption trapped them 125 million years ago.",
        "score": 884.0,
        "commentCount": 20.0
    },
    {
        "id": "t3_18i5u8u",
        "createdAt": "2023-12-14T10:35:43.172000+0000",
        "title": "TIL that monkeys in Ethiopia have managed to \"domesticate\" wild wolves by helping them hunt small rodents. The wolves now coexist with (even baby!) monkeys without ever attacking them, instead going for smaller, harder-to-catch prey!",
        "score": 15374.0,
        "commentCount": 260.0
    },
    {
        "id": "t3_18i7kyc",
        "createdAt": "2023-12-14T12:28:49.494000+0000",
        "title": "TIL When Machiavelli was tasked with writing the history of Florence by the Pope, he faced having to say unpleasant truths about the Pope's family(the Medici). In order to avoid displeasing him but remain objective, he included all the negatives about his family as words uttered by their enemies",
        "score": 16093.0,
        "commentCount": 333.0
    },
    {
        "id": "t3_18i8k1s",
        "createdAt": "2023-12-14T13:25:08.718000+0000",
        "title": "TIL a recent study analyzed the search results for the terminology of 28 industries to identify which industry uses the \"most impenetrable language\" and the IT & Telecoms industry finished first with 54 million searches. Followed by finance with 43.6 million and law with 43 million.",
        "score": 903.0,
        "commentCount": 39.0
    },
    {
        "id": "t3_18i9p4m",
        "createdAt": "2023-12-14T14:22:57.928000+0000",
        "title": "TIL of \"Space Karaagekun\", the popular chicken nuggets from Japan's Lawson convenience stores that are formulated for Japanese astronauts to eat in space",
        "score": 104.0,
        "commentCount": 2.0
    },
    {
        "id": "t3_18i9pi3",
        "createdAt": "2023-12-14T14:23:27.017000+0000",
        "title": "TIL that while Manhattan has ~90 bookstores, the Bronx had *zero* between when the last Barnes and Noble closed (2014) and when \"The Lit. Bar\" opened (2019).",
        "score": 427.0,
        "commentCount": 55.0
    },
    {
        "id": "t3_18iaa7v",
        "createdAt": "2023-12-14T14:50:21.647000+0000",
        "title": "TIL Vredefort Asteroid crater is the biggest known crater on the planet. Researchers from the University of Rochester in the US believe the impactor was 20 kilometers in diameter and the crater 250 to 280 kilometers in size.",
        "score": 100.0,
        "commentCount": 8.0
    },
    {
        "id": "t3_18ialg3",
        "createdAt": "2023-12-14T15:04:31.039000+0000",
        "title": "TIL that people pronounce the beginning of the word \"giga\" as in gigabyte very differently including /ɡɪ/ (as in gig), /dʒɪ/ (as in jig), /ɡaɪ/ (as in guy) and even /dʒaɪ/ (as in giant).",
        "score": 0.0,
        "commentCount": 78.0
    },
    {
        "id": "t3_18iap22",
        "createdAt": "2023-12-14T15:09:01.205000+0000",
        "title": "TIL that the national anthem of South Africa is named \"National Anthem of South Africa\", and is sung in five languages over four verses.",
        "score": 181.0,
        "commentCount": 17.0
    },
    {
        "id": "t3_18iayxk",
        "createdAt": "2023-12-14T15:21:45.564000+0000",
        "title": "TIL The oldest golf course in Scotland dates back to 1552, whereas the oldest course outside of Scotland (in France) dates back to 1856.",
        "score": 1413.0,
        "commentCount": 25.0
    },
    {
        "id": "t3_18ib5yr",
        "createdAt": "2023-12-14T15:30:50.652000+0000",
        "title": "TIL that Microsoft Flight Simulator is Microsoft's longest running product line, with the first release being in November 1982, nearly 3 years before Windows 1.0.",
        "score": 1024.0,
        "commentCount": 50.0
    },
    {
        "id": "t3_18ibgyf",
        "createdAt": "2023-12-14T15:45:22.048000+0000",
        "title": "TIL that grapheme-color synesthetes are people who perceive black-and-white letters and numbers in color, and changing a letter can change their perception of its color - i.e., adding a line to change a 'P' to an 'R' can change its color from yellow to orange.",
        "score": 242.0,
        "commentCount": 17.0
    },
    {
        "id": "t3_18ibtzo",
        "createdAt": "2023-12-14T16:02:00.654000+0000",
        "title": "TIL about the Ignoble noble prize, a parody of the noble prize that awards people on imaginative, unusual and funny research. For example, Marc-Antoine Fardin, for using fluid dynamics to probe the question \"Can a cat be both a solid and a liquid?\"",
        "score": 223.0,
        "commentCount": 28.0
    },
    {
        "id": "t3_18id2sx",
        "createdAt": "2023-12-14T16:58:09.598000+0000",
        "title": "TIL that since the construction of the oval office in 1909, a total of six different desks have been used by 20 Presidents. 8 Presidents used the Resolute desk, 6 used the Theodore Roosevelt Desk, 2 used the Hoover Desk, 2 used the Wilson Desk, 1 used the C&O desk and 1 used the Johnson desk",
        "score": 4740.0,
        "commentCount": 291.0
    },
    {
        "id": "t3_18iecgg",
        "createdAt": "2023-12-14T17:53:26.294000+0000",
        "title": "TIL the Baiji was a species of obligate freshwater river dolphin native to China's Yangtze River, last photographed in 2002. An extensive 6-week multi-vessel visual and acoustic survey in 2006 covering its entire historical range failed to find any evidence that the species survives.",
        "score": 6264.0,
        "commentCount": 170.0
    },
    {
        "id": "t3_18ifni4",
        "createdAt": "2023-12-14T18:50:41.403000+0000",
        "title": "TIL that knots are mathematically studied and have their own theory, classifications, and properties; a“mathematical” knot is just slightly different from regular knots and is formed when the ends of a regular knot are joined",
        "score": 549.0,
        "commentCount": 24.0
    },
    {
        "id": "t3_18ihd9s",
        "createdAt": "2023-12-14T20:07:13.230000+0000",
        "title": "TIL tennis balls used to be black and white, but changed to yellow for TV viewers thanks to David Attenborough's suggestion",
        "score": 21682.0,
        "commentCount": 541.0
    },
    {
        "id": "t3_18ijjpl",
        "createdAt": "2023-12-14T21:44:29.122000+0000",
        "title": "TIL the Mayan Lords of Xibalba (place of fright) underworld had an entrance through a cave system in Guatemala, or Belize, or the Milky Way. Hun-Came (One Death) is the more senior Lord of Xibalba, followed by Vucub-Came (Seven Death)",
        "score": 63.0,
        "commentCount": 5.0
    },
    {
        "id": "t3_18ijljr",
        "createdAt": "2023-12-14T21:46:46.148000+0000",
        "title": "TIL Anne Greene was accused of infanticide in 1650. She was hanged despite evidence she had miscarried. Her body was taken to Oxford for dissection, but they found she had a faint pulse. After treatments that included a smoke enema, she was revived and later pardoned in the belief God had saved her",
        "score": 22715.0,
        "commentCount": 728.0
    },
    {
        "id": "t3_18ijx86",
        "createdAt": "2023-12-14T22:00:59.220000+0000",
        "title": "TIL that in Yucatan, Mexico, are a cave where snakes hang from cracks of the ceiling of the rock. This snake developed this habit for catch bats, its main food",
        "score": 535.0,
        "commentCount": 57.0
    },
    {
        "id": "t3_18ikc76",
        "createdAt": "2023-12-14T22:19:01.061000+0000",
        "title": "TIL, of the Toledo War. A boundary dispute between the U.S. state of Ohio and the adjoining territory of Michigan over what is now known as the Toledo Strip from 1835 to 1836. Only one person on the Michigan side was injured and no one was killed. The result of the dispute was inconclusive.",
        "score": 981.0,
        "commentCount": 75.0
    },
    {
        "id": "t3_18illzd",
        "createdAt": "2023-12-14T23:14:41.449000+0000",
        "title": "TIL there's a city in Texas called Paris which has a 65-foot Eiffel Tower with a red cowboy hat at the top",
        "score": 951.0,
        "commentCount": 113.0
    },
    {
        "id": "t3_18ilp6c",
        "createdAt": "2023-12-14T23:18:45.423000+0000",
        "title": "TIL in the U.S. there are some private, for-profit ambulance agencies that will bill a person for responding to a scene even if that person refuses treatment and/or transportation and was not the one who called 911.",
        "score": 2902.0,
        "commentCount": 221.0
    },
    {
        "id": "t3_18imcuf",
        "createdAt": "2023-12-14T23:49:47.817000+0000",
        "title": "TIL Signs of low birth rates in France have been around since the 17th century (1600s), and eventually low birth rates began in earnest in the 1760s. It was overwhelmingly earlier than any other country in the world. eventually France lost its status as a population behemoth.",
        "score": 4020.0,
        "commentCount": 184.0
    },
    {
        "id": "t3_18imodo",
        "createdAt": "2023-12-15T00:04:34.352000+0000",
        "title": "TIL the Chevy Suburban has a star on Hollywood Walk of Fame.",
        "score": 1712.0,
        "commentCount": 105.0
    },
    {
        "id": "t3_18ip8h4",
        "createdAt": "2023-12-15T02:12:52.056000+0000",
        "title": "TIL, The Honda Super Cub is the most produced motor vehicle in history. In manufacture since 1958 with production surpassing 60 million in 2008, 87 million in 2014, and 100 million in 2017.",
        "score": 686.0,
        "commentCount": 49.0
    },
    {
        "id": "t3_18ip9uz",
        "createdAt": "2023-12-15T02:14:56.305000+0000",
        "title": "TIL The International Space Station doesn’t spin because it’s used for low-gravity research",
        "score": 122.0,
        "commentCount": 18.0
    },
    {
        "id": "t3_18iq4xr",
        "createdAt": "2023-12-15T03:00:27.614000+0000",
        "title": "TIL the largest air force in the world is the US Air Force. The second largest air force in the world is the US Navy",
        "score": 14926.0,
        "commentCount": 1138.0
    },
    {
        "id": "t3_18iq6fh",
        "createdAt": "2023-12-15T03:02:20.092000+0000",
        "title": "TIL that many Native American hieroglyphics derive symbols from “Hand Talk” which was widely used by hearing and deaf American Indians. One variation, PISL (Plains Indian Sign Language), allowed communication to surpass language barriers between widespread tribes of different spoken languages.",
        "score": 158.0,
        "commentCount": 12.0
    },
    {
        "id": "t3_18ir32z",
        "createdAt": "2023-12-15T03:50:35.580000+0000",
        "title": "TIL Approximately 50% of babies begin crawling by 8 months. But some babies may start before 6 months, and others may not crawl until after 11 months, if ever",
        "score": 600.0,
        "commentCount": 154.0
    },
    {
        "id": "t3_18irmgg",
        "createdAt": "2023-12-15T04:20:57.502000+0000",
        "title": "TIL that Mao Zedong gave out a box of mangoes gifted to him by Pakistan. A cult formed in China for the unfamiliar fruit. Replicas were made and publicly displayed. One man said that the fruit didn't look like anything special, and was shamefully paraded around his town and then publicly executed.",
        "score": 10040.0,
        "commentCount": 378.0
    },
    {
        "id": "t3_18is7d4",
        "createdAt": "2023-12-15T04:54:19.112000+0000",
        "title": "TIL two frenchmen crashed & died trying to cross the English Channel in a hot-air balloon in 1785. It's considered one of the first fatal aviation accidents",
        "score": 156.0,
        "commentCount": 5.0
    },
    {
        "id": "t3_18is87d",
        "createdAt": "2023-12-15T04:55:44.628000+0000",
        "title": "TIL that most teaching skeletons came from black market sales in India. Exporting human remains became was banned in 1986, but illegal sales continue",
        "score": 147.0,
        "commentCount": 7.0
    },
    {
        "id": "t3_18iszjd",
        "createdAt": "2023-12-15T05:40:58.855000+0000",
        "title": "TIL: Walt Disney and Ray Kroc were ambulance attendant trainees together during WWI and remained friends after the war.",
        "score": 282.0,
        "commentCount": 6.0
    },
    {
        "id": "t3_18it3nl",
        "createdAt": "2023-12-15T05:48:00.675000+0000",
        "title": "TIL that the most widely spoken language in the Southern Hemisphere is Portuguese",
        "score": 860.0,
        "commentCount": 167.0
    },
    {
        "id": "t3_18ittpn",
        "createdAt": "2023-12-15T06:33:33.486000+0000",
        "title": "TIL that prior to the 1970 amendment to the 1965 Voting Rights Act, the legal voting age in the US was 21 - the act lowered it to 18",
        "score": 959.0,
        "commentCount": 148.0
    },
    {
        "id": "t3_18iutz6",
        "createdAt": "2023-12-15T07:41:22.068000+0000",
        "title": "TIL in 400 BCE, Ancient Chinese hydraulic engineer and philosopher Ximen Bao, upon discovering a group of county elders terrorizing their subjects, requiring a maiden sacrifice to appease a river god, had them \"sacrificed\" instead, and built the county a canal system to control the flooding.",
        "score": 1401.0,
        "commentCount": 21.0
    },
    {
        "id": "t3_18iwmkt",
        "createdAt": "2023-12-15T09:53:51.897000+0000",
        "title": "TIL in 1939, RKO Pictures offered a young Orson Welles with what is generally regarded as the greatest contract offered to a filmmaker in history. The contract gave Welles’ full creative control to write, produce, direct, and perform in two films. His first film under the contract? “Citizen Kane”.",
        "score": 4777.0,
        "commentCount": 162.0
    },
    {
        "id": "t3_18iyht3",
        "createdAt": "2023-12-15T11:59:00.090000+0000",
        "title": "TIL of the scarecrow massacre of 1986. Joe Delaney had built a village of scarecrows in 1984. In 86 the village was attacked and 45 of the 46 scarecrows were destroyed, leaving Rory the only survivor. Joe would rebuild and the scarecrow population increased to over 100.",
        "score": 238.0,
        "commentCount": 12.0
    },
    {
        "id": "t3_18iyq4e",
        "createdAt": "2023-12-15T12:12:49.359000+0000",
        "title": "TIL that the F50 foiling catamaran can sail almost 4 times faster than the wind and reach 100 km/h.",
        "score": 4328.0,
        "commentCount": 205.0
    },
    {
        "id": "t3_18j0kxm",
        "createdAt": "2023-12-15T13:52:13.817000+0000",
        "title": "TIl that citizens of Monaco are banned from gambling or working at casinos. The famed Monte Carlo Casino is strictly for foreigners only",
        "score": 13169.0,
        "commentCount": 552.0
    },
    {
        "id": "t3_18j24xk",
        "createdAt": "2023-12-15T15:05:30.185000+0000",
        "title": "TIL: About the nearly century long Oyster Wars between oyster pirates, authorities, and watermen from 1865-1959. After the Civil War, Chesapeake Bay became an oyster battlefield. The Oyster Police Force formed to combat oyster pirates such as The Dancing Molly, a sloop ran by 3 women oyster pirates",
        "score": 1474.0,
        "commentCount": 45.0
    },
    {
        "id": "t3_18j2u62",
        "createdAt": "2023-12-15T15:37:21.444000+0000",
        "title": "TIL the three biggest organizations that report on Hollywood and the entertainment industry are owned by the same company",
        "score": 615.0,
        "commentCount": 22.0
    },
    {
        "id": "t3_18j3em7",
        "createdAt": "2023-12-15T16:02:15.219000+0000",
        "title": "TIL Sonia Orwell, second wife of George Orwell, died penniless in December 1980, having spent a fortune trying to protect Orwell's name.",
        "score": 6438.0,
        "commentCount": 197.0
    },
    {
        "id": "t3_18j41gl",
        "createdAt": "2023-12-15T16:31:10.979000+0000",
        "title": "TIL of \"vie fittizie\", aka \"fictitious streets\" in Italy. As Italians need a fixed address to access gov't services, these fake streets were originally invented to register traveling workers like circus performers. Today, they are used to register the homeless",
        "score": 144.0,
        "commentCount": 0.0
    },
    {
        "id": "t3_18j487q",
        "createdAt": "2023-12-15T16:39:26.729000+0000",
        "title": "TIL that Laurence Fishburne used to be credited as “Larry Fishburne” his movies, including Boyz n the Hood. He began using “Laurence” in 1993.",
        "score": 858.0,
        "commentCount": 77.0
    },
    {
        "id": "t3_18j4xd5",
        "createdAt": "2023-12-15T17:09:36.790000+0000",
        "title": "TIL the song \"Brandy\" by The O'Jays, that sold over 1 million copies was not about a woman, but about a dog.",
        "score": 802.0,
        "commentCount": 154.0
    },
    {
        "id": "t3_18j70hr",
        "createdAt": "2023-12-15T18:40:24.808000+0000",
        "title": "TIL that when Hendrik Verwoerd (the 6th Prime Minister of South Africa) was assassinated in 1966, a bloodstain remained on the carpet in Parliment for 38 years, not being removed until 2004.",
        "score": 2002.0,
        "commentCount": 27.0
    },
    {
        "id": "t3_18j7nmk",
        "createdAt": "2023-12-15T19:07:36.912000+0000",
        "title": "TIL ravens can copy sounds and phrases like parrots",
        "score": 76.0,
        "commentCount": 33.0
    },
    {
        "id": "t3_18j9b1v",
        "createdAt": "2023-12-15T20:21:57.509000+0000",
        "title": "TIL Female bees, wasps, and ants are often more related to their siblings than they are to their offspring",
        "score": 389.0,
        "commentCount": 44.0
    },
    {
        "id": "t3_18jas09",
        "createdAt": "2023-12-15T21:28:21.410000+0000",
        "title": "TIL after getting LASIK surgery, Horace Grant continued to wear his signature goggles without the prescription in order to remain a positive influence so kids who needed glasses would think it's cool",
        "score": 31912.0,
        "commentCount": 430.0
    },
    {
        "id": "t3_18jb1x7",
        "createdAt": "2023-12-15T21:40:38.070000+0000",
        "title": "TIL of the DART (Double Asteroid Redirection Test) spacecraft, designed to deflect an object on collision course with Earth. The craft hit an 160m wide asteroid called Dimorphos at 23,760mph. It was the first time humans had managed change the orbit of a planetary object.",
        "score": 836.0,
        "commentCount": 53.0
    },
    {
        "id": "t3_18jbbo4",
        "createdAt": "2023-12-15T21:52:51.250000+0000",
        "title": "TIL: Malcolm Caldwell was a Scottish academic who supported the Khmer Rouge so much he went over to Cambodia to meet Pol Pot and got promptly murdered",
        "score": 12877.0,
        "commentCount": 1259.0
    },
    {
        "id": "t3_18jcbea",
        "createdAt": "2023-12-15T22:37:20.884000+0000",
        "title": "TIL Jan Carstenszoon, The first European to discover Puncak Jaya, was ridiculed in Europe when he said he had seen snow near the equator.",
        "score": 4158.0,
        "commentCount": 37.0
    },
    {
        "id": "t3_18jck83",
        "createdAt": "2023-12-15T22:48:33.066000+0000",
        "title": "TIL that the \"seductive nature\" of the Green M&M is a reference to an urban legend during the 1970s that green M&Ms were aphrodisiacs",
        "score": 4539.0,
        "commentCount": 157.0
    },
    {
        "id": "t3_18jecrg",
        "createdAt": "2023-12-16T00:12:37.382000+0000",
        "title": "Today I learned that they created an unburnable copy of The Handmaid's Tale in 2022.",
        "score": 908.0,
        "commentCount": 191.0
    },
    {
        "id": "t3_18jftwq",
        "createdAt": "2023-12-16T01:26:09.914000+0000",
        "title": "TIL about 'The Campaign for North Africa' - a board game published in 1978 that is estimated to take 62 days to play. The game includes 1,600 counters and the level of detail is such that Italian troops require additional water supplies in order to boil pasta.",
        "score": 8897.0,
        "commentCount": 310.0
    },
    {
        "id": "t3_18jhvca",
        "createdAt": "2023-12-16T03:17:05.474000+0000",
        "title": "TIL some companies use lead-based dyes to make their color-dependent products more appealing to customers, e.g. spices like chili powder, turmeric, and cumin. Scientists measure amount of protein by nitrogen content so some companies put melamine to baby formula because its rich in nitrogen.",
        "score": 3329.0,
        "commentCount": 231.0
    },
    {
        "id": "t3_18ji3ci",
        "createdAt": "2023-12-16T03:29:35.437000+0000",
        "title": "TIL A Banyan tree in northwestern Pakistan, which was put in chains by a drunk British army officer after he placed it “under arrest” during the region’s oppressive colonial period, continues to bear the weight of its metal bearings despite a lapse of around 120 years.",
        "score": 7739.0,
        "commentCount": 240.0
    },
    {
        "id": "t3_18jkbks",
        "createdAt": "2023-12-16T05:37:41.536000+0000",
        "title": "TIL That people can become blind and still respond to light, but the brain cannot process it.",
        "score": 1517.0,
        "commentCount": 50.0
    },
    {
        "id": "t3_18jkooo",
        "createdAt": "2023-12-16T06:00:06.710000+0000",
        "title": "TIL - Africa's Great Green Wall is an ambitious project aimed at combating desertification and improving living conditions in arid regions. The plan involves several sub-Saharan African countries and aims to plant a broad belt of trees across the center of the continent.",
        "score": 163.0,
        "commentCount": 23.0
    },
    {
        "id": "t3_18jkvtu",
        "createdAt": "2023-12-16T06:11:59.693000+0000",
        "title": "TIL Switzerlands fire service duty is mandatory for all, including non-Swiss, mostly in Militia Brigades. Of 95'000 firefighters only 1'200 are professionals. Areas with professional brigades, like Zurich, are exceptions. Low volunteer numbers may lead to forced recruitment opting out to a fire tax.",
        "score": 256.0,
        "commentCount": 12.0
    },
    {
        "id": "t3_18jl3bg",
        "createdAt": "2023-12-16T06:26:08.050000+0000",
        "title": "TIL: Many choking deaths happen in bathrooms. It turns out that people who start choking often feel embarrassed and rush to the bathroom for privacy, only to end up dying alone, often next to a toilet. 😳",
        "score": 7055.0,
        "commentCount": 250.0
    },
    {
        "id": "t3_18jl4uv",
        "createdAt": "2023-12-16T06:29:12.519000+0000",
        "title": "TIL the top soil layer of earth is called the pedosphere",
        "score": 247.0,
        "commentCount": 102.0
    },
    {
        "id": "t3_18jlty8",
        "createdAt": "2023-12-16T07:15:00.051000+0000",
        "title": "TIL that upon his death in 1898, the legendary statesman Otto Von Bismarck managed one final rebuke of Kaiser Wilhelm II by having his tomb inscribed with the epitaph \"Ein treuer deutscher Diener Kaiser Wilhelms I\" - \"A loyal (faithful) servant of Kaiser Wilhelm I\".",
        "score": 2207.0,
        "commentCount": 48.0
    },
    {
        "id": "t3_18jlzmd",
        "createdAt": "2023-12-16T07:26:00.524000+0000",
        "title": "TIL The smallest book ever written is called Teeny Ted From Turnip Town",
        "score": 58.0,
        "commentCount": 10.0
    },
    {
        "id": "t3_18jmnrt",
        "createdAt": "2023-12-16T08:14:08.323000+0000",
        "title": "TIL about Filip Višnjić, a blind Serbian epic poet and guslar. Višnjić went blind at the age of eight or nine after contracting smallpox. He also lost his family early in life. He spent years wandering the Balkans as a vagabond, and performed and begged for a living.",
        "score": 87.0,
        "commentCount": 2.0
    },
    {
        "id": "t3_18jny5q",
        "createdAt": "2023-12-16T09:49:07.887000+0000",
        "title": "TIL Louis Bonaparte, the puppet king of Holland who was Napoleon I’s brother and III’s father, could not decide his capital city. He evicted a wealthy merchant so he could live in his home and moved out after 7 weeks.",
        "score": 429.0,
        "commentCount": 10.0
    },
    {
        "id": "t3_18jo1fi",
        "createdAt": "2023-12-16T09:55:56.121000+0000",
        "title": "TIL Canada has a Tartan Day (Oct 21) and the world's first Air Force tartan",
        "score": 37.0,
        "commentCount": 6.0
    },
    {
        "id": "t3_18jpor0",
        "createdAt": "2023-12-16T11:53:17.477000+0000",
        "title": "TIL The prefix \"kilo\" meaning \"thousand\" was adopted in 1795, but the prefix \"mega\" meaning \"million\" wasn't adopted until 1873.",
        "score": 452.0,
        "commentCount": 39.0
    },
    {
        "id": "t3_18jpvtr",
        "createdAt": "2023-12-16T12:06:13.846000+0000",
        "title": "TIL - Rammstein once played a concert in Hamburg, Germany and the physics department of the local university picked it up on their seismograph. They did not register the sound, but literally the shaking ground.",
        "score": 9054.0,
        "commentCount": 301.0
    },
    {
        "id": "t3_18jqr9d",
        "createdAt": "2023-12-16T13:01:45.324000+0000",
        "title": "TIL Despite Bonnie and Clyde’s deaths in 1934, the last member of their gang was alive until 1993",
        "score": 1451.0,
        "commentCount": 38.0
    },
    {
        "id": "t3_18jrg66",
        "createdAt": "2023-12-16T13:41:04.108000+0000",
        "title": "TIL the psoas minor is a muscle that only 40% of people have.",
        "score": 6830.0,
        "commentCount": 278.0
    },
    {
        "id": "t3_18jt1m7",
        "createdAt": "2023-12-16T15:03:13.015000+0000",
        "title": "TIL the NTSB found a rare malfunction (<1%) caused 2 Boeing 737 crashes. When a chilled control unit got scalding hydraulic fluid, the plane's rudder could jam or reverse direction. Boeing & the FAA blamed pilots for confusing the controls but later the FAA agreed with the NTSB.",
        "score": 2221.0,
        "commentCount": 55.0
    },
    {
        "id": "t3_18jv85e",
        "createdAt": "2023-12-16T16:50:28.628000+0000",
        "title": "TIL in 1974, a new technology called Sensurround was installed in cinemas to stimulate earthquake",
        "score": 136.0,
        "commentCount": 39.0
    },
    {
        "id": "t3_18jvndw",
        "createdAt": "2023-12-16T17:09:35.667000+0000",
        "title": "TIL the pilot Hans Lutz kept his job because of a shortage even after he nearly landed in the wrong country and retracted a plane's landing gear before taking off. This backfired when he tried to land while unable to see the runway and crashed, killing 23 people and himself.",
        "score": 2803.0,
        "commentCount": 63.0
    },
    {
        "id": "t3_18jw8lu",
        "createdAt": "2023-12-16T17:36:52.987000+0000",
        "title": "TIL the nickname \"Trey\" comes from being the third generation with the same name. Trey Parker's is actually a Randolph III, Trey Anastasio is actually Ernest III, and Tré Cool's real name is Frank Edwin Wright III.",
        "score": 1202.0,
        "commentCount": 152.0
    },
    {
        "id": "t3_18jwopg",
        "createdAt": "2023-12-16T17:58:10.885000+0000",
        "title": "TIL there were no red M&Ms from 1976 to 1987. The Mars company succumbed to a brief bout of hysteria in 1976, when federal regulations identified red food coloring, or Red Dye No. 2, as a possible health risk.",
        "score": 1222.0,
        "commentCount": 149.0
    },
    {
        "id": "t3_18jwssp",
        "createdAt": "2023-12-16T18:03:11.480000+0000",
        "title": "TIL sailfish have left- and right-bill usage preference correlated with capture success rate to attack their prey fish. Individuals with left- and right-bill preferences are about equally frequent so prey fish cannot predict a direction to escape the small teeth on attacking sailfish bills",
        "score": 118.0,
        "commentCount": 1.0
    },
    {
        "id": "t3_18jyf02",
        "createdAt": "2023-12-16T19:19:03.091000+0000",
        "title": "TIL The American gulf shrimp(common in USA) is technically a prawn, while the Northern prawn (common in U.K.)is technically a shrimp and not a prawn",
        "score": 1392.0,
        "commentCount": 52.0
    },
    {
        "id": "t3_18jykff",
        "createdAt": "2023-12-16T19:26:29.868000+0000",
        "title": "TIL frankincense and myrrh are the dried sap of trees, also known as resin",
        "score": 5981.0,
        "commentCount": 120.0
    },
    {
        "id": "t3_18jywth",
        "createdAt": "2023-12-16T19:43:27.099000+0000",
        "title": "TIL the word 'dumpster' was originally a patented name brand for a garbage disposal container, derived from the word dump and the company name Dempster",
        "score": 522.0,
        "commentCount": 39.0
    },
    {
        "id": "t3_18k04n3",
        "createdAt": "2023-12-16T20:41:04.162000+0000",
        "title": "TIL There was a study in Africa that showed that cows with large eye painted on their butts would not be attacked by ambush predators.",
        "score": 4436.0,
        "commentCount": 78.0
    },
    {
        "id": "t3_18k11el",
        "createdAt": "2023-12-16T21:24:55.786000+0000",
        "title": "TIL that Steven Segal backed down from a fight with Jean Claude van Damme after JCvD called his bluff at a party hosted by Stallone",
        "score": 22383.0,
        "commentCount": 1627.0
    },
    {
        "id": "t3_18k3470",
        "createdAt": "2023-12-16T23:05:49.806000+0000",
        "title": "TIL that the captive crews of the USS Pueblo were secretly giving the middle finger to their North Korean captors in photos under the guise that it was Hawaiian for \"Good Luck\".",
        "score": 1885.0,
        "commentCount": 7.0
    },
    {
        "id": "t3_18k37kq",
        "createdAt": "2023-12-16T23:10:26.038000+0000",
        "title": "TIL that the patent for the fire hydrant was lost in a fire.",
        "score": 229.0,
        "commentCount": 5.0
    },
    {
        "id": "t3_18k4fbl",
        "createdAt": "2023-12-17T00:09:44.917000+0000",
        "title": "TIL that the ancient Indians tested for diabetes by looking at whether ants were attracted to a person's (sweet) urine",
        "score": 3004.0,
        "commentCount": 78.0
    },
    {
        "id": "t3_18k4ht6",
        "createdAt": "2023-12-17T00:13:10.981000+0000",
        "title": "TIL Rjukan sun: the Norwegian town that light up the town square with mirrors during the winter months.",
        "score": 273.0,
        "commentCount": 13.0
    },
    {
        "id": "t3_18k4lz6",
        "createdAt": "2023-12-17T00:18:54.839000+0000",
        "title": "TIL that the Nike logo was designed for 35$ but the company gifted the designer stock that is now worth millions because she held it all without selling.",
        "score": 26165.0,
        "commentCount": 535.0
    },
    {
        "id": "t3_18k59i8",
        "createdAt": "2023-12-17T00:52:40.942000+0000",
        "title": "TIL According to Guinness World Records, the oldest cat ever recorded (a mixed Tabby female named Creme Puff) lived to be 38 years and 3 days old.",
        "score": 462.0,
        "commentCount": 19.0
    },
    {
        "id": "t3_18k5p1f",
        "createdAt": "2023-12-17T01:15:08.330000+0000",
        "title": "TIL Roosters break the dawn every morning as a function of their circadian clock.",
        "score": 248.0,
        "commentCount": 38.0
    },
    {
        "id": "t3_18k5rpk",
        "createdAt": "2023-12-17T01:18:59.666000+0000",
        "title": "TIL, when securing the movie rights for ''The Polar Express'' (1985), one stipulation was that the resulting movie could not be animated. To preserve his vision, Robert Zemeckis opted for motion capture technology during the film's production.",
        "score": 9302.0,
        "commentCount": 271.0
    },
    {
        "id": "t3_18k5up6",
        "createdAt": "2023-12-17T01:23:15.990000+0000",
        "title": "TIL Babies are born feet, bottoms first in 3–4% of full-term births. Upside down breech babies usually involve a cesarean delivery",
        "score": 336.0,
        "commentCount": 78.0
    },
    {
        "id": "t3_18k5xqs",
        "createdAt": "2023-12-17T01:27:43.658000+0000",
        "title": "TIL about “The Night the Animals Talked” (1970). A short film about the nativity, which addressed racism and only broadcasted 4 times.",
        "score": 30.0,
        "commentCount": 0.0
    },
    {
        "id": "t3_18k7a8n",
        "createdAt": "2023-12-17T02:40:41.353000+0000",
        "title": "TIL the ‘50s song “Fujiyama Mama” had controversial references to dropping the A-Bombs on Hiroshima & Nagasaki, yet was more popular in Japan than America.",
        "score": 166.0,
        "commentCount": 20.0
    },
    {
        "id": "t3_18k82s3",
        "createdAt": "2023-12-17T03:26:11.421000+0000",
        "title": "TIL CNET download.com is one of the longest-running software archives since the World Wide Web got popular, now almost 28 years old after launching in 1996.",
        "score": 721.0,
        "commentCount": 32.0
    },
    {
        "id": "t3_18k874a",
        "createdAt": "2023-12-17T03:33:18.134000+0000",
        "title": "TIL calling a play Broadway vs Off-Broadway is based on the number of seats in the theater. Broadway having over 500, Off-Broadway between 100-499, and Off-Off-Broadway having less than 99.",
        "score": 143.0,
        "commentCount": 20.0
    },
    {
        "id": "t3_18ka46c",
        "createdAt": "2023-12-17T05:28:13.037000+0000",
        "title": "TIL no flights existed between Cuba and the US in the 60s, but pilots still had maps to get there, Cuban language guides, and an official phone line between Florida and Cuba because it was so common to get hijacked by a passenger wanting to go there.",
        "score": 549.0,
        "commentCount": 25.0
    },
    {
        "id": "t3_18kac82",
        "createdAt": "2023-12-17T05:41:43.238000+0000",
        "title": "TIL, $46,729.86 Would Be Cost Of 12 Days Of Christmas Gifts",
        "score": 0.0,
        "commentCount": 15.0
    },
    {
        "id": "t3_18kacy9",
        "createdAt": "2023-12-17T05:42:58.401000+0000",
        "title": "TIL that Hershey’s chocolate and Hershey’s ice cream were both founded in Pennsylvania in 1894, but share no connection. In the ‘90s, after many trademark lawsuits, the Hershey’s ice cream company agreed to add a disclaimer to its products noting that it is not affiliated with Hershey’s chocolate.",
        "score": 1008.0,
        "commentCount": 120.0
    },
    {
        "id": "t3_18kb1k8",
        "createdAt": "2023-12-17T06:26:04.759000+0000",
        "title": "TIL an American general was sent home in disgrace for revealing the secret D-day invasion date at a party",
        "score": 5225.0,
        "commentCount": 59.0
    },
    {
        "id": "t3_18kd5x7",
        "createdAt": "2023-12-17T08:53:31.465000+0000",
        "title": "TIL that the first person to earn a Ph.D. in computer science in the United States was Mary Kenneth Keller, a catholic nun",
        "score": 252.0,
        "commentCount": 4.0
    },
    {
        "id": "t3_18ke4z2",
        "createdAt": "2023-12-17T10:01:26.934000+0000",
        "title": "TIL Jimmy Kimmel Live! stopped airing live only one year into it's run because of Actor Thomas Jane's barrage of swearing which couldn't all be censored",
        "score": 2502.0,
        "commentCount": 210.0
    },
    {
        "id": "t3_18ke7mt",
        "createdAt": "2023-12-17T10:06:41.714000+0000",
        "title": "TIL - nacreous cloud aee one of the highest clouds in our atmosphere, they form in very cold conditions and with their shimmering colours they are often referred to as \"mother-of-pearl\"",
        "score": 67.0,
        "commentCount": 4.0
    },
    {
        "id": "t3_18kfzwx",
        "createdAt": "2023-12-17T12:07:03.415000+0000",
        "title": "TIL about ship trails. In the right conditions a cloud trail can for behind ships, similar to contrails behind planes. Ship trails can be large enough to be seen from space.",
        "score": 107.0,
        "commentCount": 13.0
    },
    {
        "id": "t3_18kh9oe",
        "createdAt": "2023-12-17T13:23:46.222000+0000",
        "title": "TIL Liechtenstein has been accidentally attacked or invaded by Switzerland 5 times since 1968. In 1968, chairs were broken by artillery. In 1976 soldiers were offered drinks by the locals. In 1985 a forest fire was started. Switzerland apologised or compensated for the damage each time.",
        "score": 4916.0,
        "commentCount": 101.0
    },
    {
        "id": "t3_18khcu6",
        "createdAt": "2023-12-17T13:28:47.954000+0000",
        "title": "TIL Rogue planets were discovered in the year 2000. Additionally the James Webb Space Telescope discovered that some rogue planets the size of Jupiter travel in pairs, which we call Jupiter-Mass Binary Objects (JuMBOs).",
        "score": 178.0,
        "commentCount": 7.0
    },
    {
        "id": "t3_18khpt3",
        "createdAt": "2023-12-17T13:48:55.647000+0000",
        "title": "TIL in 2019, basketball player DJ Cooper was suspended for two years after using his girlfriend's urine to attempt to cheat a drug test. The test \"discovered\" that he was pregnant.",
        "score": 11922.0,
        "commentCount": 228.0
    },
    {
        "id": "t3_18kim4d",
        "createdAt": "2023-12-17T14:35:33.087000+0000",
        "title": "TIL that a cat’s ability to land on their feet is referred to as a “righting reflex” and is due to their unusually flexible spine. This lets them turn each half of their spine almost independently so they can position themselves to have a perfect landing.",
        "score": 247.0,
        "commentCount": 9.0
    },
    {
        "id": "t3_18kir0s",
        "createdAt": "2023-12-17T14:42:32.054000+0000",
        "title": "TIL the Greyhound bus system in Canada pulled a series of ads saying “There’s a reason you’ve never heard of bus rage” after a man beheaded and cannibalized another rider",
        "score": 4320.0,
        "commentCount": 516.0
    },
    {
        "id": "t3_18kizce",
        "createdAt": "2023-12-17T14:53:28.418000+0000",
        "title": "TIL John Tyler, the 10th POTUS (1841-1845), has a grandson - Harrison Ruffin Tyler - who is still alive today! H.R.T. is also a descendant of Pocahontas…",
        "score": 155.0,
        "commentCount": 13.0
    },
    {
        "id": "t3_18kjo00",
        "createdAt": "2023-12-17T15:26:21.739000+0000",
        "title": "TIL PEZ was invented in the 1920’s as an alternative to smoking",
        "score": 90.0,
        "commentCount": 6.0
    },
    {
        "id": "t3_18kjs0g",
        "createdAt": "2023-12-17T15:31:31.624000+0000",
        "title": "TIL about Eddy Goldfarb, creator of over 800 popular children's toys from Yakity Yak Talking Teeth to the Bubble Gun.",
        "score": 71.0,
        "commentCount": 0.0
    },
    {
        "id": "t3_18kk68p",
        "createdAt": "2023-12-17T15:50:55.100000+0000",
        "title": "TIL America had over 50,000 pay toilets in 1970 but by 1980, there were almost none. Four teenagers formed the Committee to End Pay Toilets in America. Chicago became the first major American city to ban pay toilets altogether in March of 1973.",
        "score": 6136.0,
        "commentCount": 541.0
    },
    {
        "id": "t3_18kk95z",
        "createdAt": "2023-12-17T15:54:40.977000+0000",
        "title": "TIL Kitty Oppenheimer (Robert’s wife) enjoyed smoking and drinking in bed, leading to holes in the bedding and at least one house fire.",
        "score": 1145.0,
        "commentCount": 76.0
    },
    {
        "id": "t3_18kkb57",
        "createdAt": "2023-12-17T15:57:20.733000+0000",
        "title": "TIL: While many animals run faster than humans, the strength and positioning of our butts (gluteal muscles) gave humans the endurance to keep running and chasing prey when other animals had to stop.",
        "score": 8889.0,
        "commentCount": 307.0
    },
    {
        "id": "t3_18kksst",
        "createdAt": "2023-12-17T16:19:44.730000+0000",
        "title": "TIL: King Felipe VI of Spain is Europe's poorest monarch after he decided to reveal the full extent of his finances being worth 2.57 million euros. He owns no property or land and his wealth comes from jewels and antiques. In comparison, his wealth was 5% of Queen Elizabeth at the time.",
        "score": 16521.0,
        "commentCount": 666.0
    },
    {
        "id": "t3_18kkz2x",
        "createdAt": "2023-12-17T16:27:37.114000+0000",
        "title": "TIL that vietnam just reached 100 million of people this year",
        "score": 516.0,
        "commentCount": 89.0
    },
    {
        "id": "t3_18kn0z9",
        "createdAt": "2023-12-17T17:59:03.472000+0000",
        "title": "TIL that Homer Jones, the player credited with starting end zone celebration, did it by accident. In 1965, after catching a touchdown pass Jones wanted to toss the ball to the fans (banned at the time). So not wanting to be fined, he threw the ball to the ground instead, and called it a “Spike”.",
        "score": 338.0,
        "commentCount": 13.0
    },
    {
        "id": "t3_18kn76x",
        "createdAt": "2023-12-17T18:06:12.811000+0000",
        "title": "TIL in the last years of his life, J.R.R Tolkien, a devout catholic, resisted the liturgical changes implemented after the Second Vatican Council, especially the use of English for the liturgy. He continued to make the responses in Latin, loudly, ignoring the rest of the congregation.",
        "score": 5204.0,
        "commentCount": 297.0
    },
    {
        "id": "t3_18knqef",
        "createdAt": "2023-12-17T18:30:28.276000+0000",
        "title": "TIL that 62 countries celebrate Independence Day, specifically from the British, making it one of the most commonly celebrated (non-religious) holidays around the world.",
        "score": 1126.0,
        "commentCount": 61.0
    },
    {
        "id": "t3_18knr2m",
        "createdAt": "2023-12-17T18:31:16.613000+0000",
        "title": "TIL: Bruce Willis starred in a Saturday morning cartoon called \"Bruno the Kid\" about a nearly-bald child spy.",
        "score": 196.0,
        "commentCount": 18.0
    },
    {
        "id": "t3_18kod51",
        "createdAt": "2023-12-17T18:59:02.445000+0000",
        "title": "TIL that Narcan blocks the intoxicating effect of catnip on cats",
        "score": 1843.0,
        "commentCount": 70.0
    },
    {
        "id": "t3_18kp7kf",
        "createdAt": "2023-12-17T19:36:05.321000+0000",
        "title": "TIL high school students used to be used as school bus drivers",
        "score": 441.0,
        "commentCount": 70.0
    },
    {
        "id": "t3_18kpg1s",
        "createdAt": "2023-12-17T19:46:31.364000+0000",
        "title": "TIL in 2017, ticket sales for “The Nutcracker” represented 48% of many ballet companies’ overall revenues, up from 25% of total revenues in 2008.",
        "score": 1208.0,
        "commentCount": 29.0
    },
    {
        "id": "t3_18kriny",
        "createdAt": "2023-12-17T21:16:48.873000+0000",
        "title": "TIL that despite the existence of languages that read right-to-left (like Arabic, Persian, or Urdu), over 90% of the world is still right-handed.",
        "score": 98.0,
        "commentCount": 69.0
    },
    {
        "id": "t3_18krjii",
        "createdAt": "2023-12-17T21:17:53.835000+0000",
        "title": "TIL that the Mace of the Republic is one of the oldest symbols of the US government and its governmental authority.",
        "score": 309.0,
        "commentCount": 25.0
    },
    {
        "id": "t3_18kt07h",
        "createdAt": "2023-12-17T22:24:03.287000+0000",
        "title": "TIL there used to be a period after the New York Times logo for over a hundred years. They calculated they could save $600 in ink if they dropped it.",
        "score": 13479.0,
        "commentCount": 294.0
    },
    {
        "id": "t3_18kt12d",
        "createdAt": "2023-12-17T22:25:08.147000+0000",
        "title": "TIL that in August 2019 the city council of Bielefeld, Germany offered €1 million to anyone who could prove that their city did not exist.",
        "score": 3118.0,
        "commentCount": 81.0
    },
    {
        "id": "t3_18kt4u7",
        "createdAt": "2023-12-17T22:30:00.493000+0000",
        "title": "TIL the armistice that ended world war 1 went into effect on 11/11/18 at 11 am.",
        "score": 79.0,
        "commentCount": 146.0
    },
    {
        "id": "t3_18ktzhs",
        "createdAt": "2023-12-17T23:08:05.218000+0000",
        "title": "TIL the Rockettes first performed in New York at the Roxy Theatre as the Roxyettes. When they moved to Radio City Music Hall, they were renamed since their new home was part of Rockefeller Center.",
        "score": 134.0,
        "commentCount": 3.0
    },
    {
        "id": "t3_18kuy6j",
        "createdAt": "2023-12-17T23:52:20.360000+0000",
        "title": "TIL the last operational WW2 Steam Locomotives in regular service are in Bosnia. You can even drive them.",
        "score": 68.0,
        "commentCount": 5.0
    },
    {
        "id": "t3_18kv6ie",
        "createdAt": "2023-12-18T00:03:43.564000+0000",
        "title": "TIL The last witness to the assassination of US President Abraham Lincoln lived until 1956, when he was able to appear on the game show \"I've Got a Secret\"",
        "score": 180.0,
        "commentCount": 17.0
    },
    {
        "id": "t3_18kw001",
        "createdAt": "2023-12-18T00:45:09.056000+0000",
        "title": "TIL: To stop cannibalism among poultry in the 1940s thought to be due to natural instinct, \"Anti-Pix\" sunglasses were developed to prevent birds from seeing \"raw flesh or blood\" due to their rose color. They worked!",
        "score": 10761.0,
        "commentCount": 227.0
    },
    {
        "id": "t3_18kw5i1",
        "createdAt": "2023-12-18T00:52:55.748000+0000",
        "title": "TIL: In about six weeks a transplanted liver section will grow into a normal-sized, fully functioning liver in a recipient, while the donor’s remaining liver will regenerate to replace the transplanted section.",
        "score": 7572.0,
        "commentCount": 124.0
    },
    {
        "id": "t3_18kw5i3",
        "createdAt": "2023-12-18T00:52:55.787000+0000",
        "title": "TIL there are experiments finding clear evidence for \"procrastination\" among pigeons",
        "score": 270.0,
        "commentCount": 9.0
    },
    {
        "id": "t3_18kw977",
        "createdAt": "2023-12-18T00:58:23.728000+0000",
        "title": "TIL that for several years Mick Jagger believed he was the father of Liv Tyler",
        "score": 5747.0,
        "commentCount": 556.0
    },
    {
        "id": "t3_18kwka2",
        "createdAt": "2023-12-18T01:13:51.059000+0000",
        "title": "TIL that over five years after 9/11, mail was still occasionally being sent to the WTC’s ZIP code of 10048, mostly from businesses that hadn’t yet updated their bulk mailing lists",
        "score": 3934.0,
        "commentCount": 87.0
    },
    {
        "id": "t3_18kyol1",
        "createdAt": "2023-12-18T03:07:06.150000+0000",
        "title": "TIL: Rattlesnakes climb trees.",
        "score": 165.0,
        "commentCount": 44.0
    },
    {
        "id": "t3_18kyos3",
        "createdAt": "2023-12-18T03:07:25.468000+0000",
        "title": "TIL on 50 Cent’s third album entitled “Curtis” the song “Man Down” is censored even on the explicit version of the album. The executives at Interscope Records felt the song portrayed violence towards police officers and refused to let him release the song with the full lyrics.",
        "score": 801.0,
        "commentCount": 78.0
    },
    {
        "id": "t3_18l0px8",
        "createdAt": "2023-12-18T04:59:54.503000+0000",
        "title": "TIL that the Milky Way Galaxy is being pulled toward a mysterious area in space called \"The Great Attractor\" at about 6000km/s. Whatever it is, we can't see it from Earth because it's obscured the hub of our galaxy.",
        "score": 19835.0,
        "commentCount": 1235.0
    },
    {
        "id": "t3_18l1kpu",
        "createdAt": "2023-12-18T05:50:29.940000+0000",
        "title": "TIL that when the region of Bougainville declared its independence from Papua New Guinea in 1975, the PNG's government simply ignored the secession. The region was reintegrated in the next 6 months without any bloodshed",
        "score": 3386.0,
        "commentCount": 47.0
    },
    {
        "id": "t3_18l3e1t",
        "createdAt": "2023-12-18T07:52:24.340000+0000",
        "title": "TIL about Rani Karnavati, the Indian queen who successfully defended and repelled an invasion of the Mughal army of Shah Jahan led by Najabat Khan in 1640 and chopped off their noses. This incident earned her the name of Nak Kati Rani( The queen who cut noses).",
        "score": 119.0,
        "commentCount": 6.0
    },
    {
        "id": "t3_18l3qwf",
        "createdAt": "2023-12-18T08:17:32.225000+0000",
        "title": "TIL cherries are dried with helicopters",
        "score": 3242.0,
        "commentCount": 100.0
    },
    {
        "id": "t3_18l5rda",
        "createdAt": "2023-12-18T10:39:34.614000+0000",
        "title": "TIL that sugar may actually increase the effectiveness of antibiotics",
        "score": 923.0,
        "commentCount": 21.0
    },
    {
        "id": "t3_18l5uvz",
        "createdAt": "2023-12-18T10:46:05.282000+0000",
        "title": "TIL: Camels have three eyelids to protect themselves from the blowing desert sand",
        "score": 823.0,
        "commentCount": 19.0
    },
    {
        "id": "t3_18l6bw2",
        "createdAt": "2023-12-18T11:16:47.626000+0000",
        "title": "TIL about Capoeira carioca, a street fighting variation of the martial art capoeira that existed in Rio de Janeiro in the 19th century and allowed for the use of razors, machetes, and knives.",
        "score": 481.0,
        "commentCount": 33.0
    },
    {
        "id": "t3_18l9nkc",
        "createdAt": "2023-12-18T14:13:02.861000+0000",
        "title": "TIL in 2005 baseball player John Mcdonald was traded from the Toronto Blue Jays to the Detroit Tigers for a 'player to be named later'. In 2006 John Mcdonald was traded back to the Toronto Blue Jays as the 'Player to be named later'. Essentially meaning John McDonald was traded for himself.",
        "score": 7188.0,
        "commentCount": 119.0
    },
    {
        "id": "t3_18la39c",
        "createdAt": "2023-12-18T14:33:08.941000+0000",
        "title": "TIL Fruit flies (Drosophila) are known to have the longest sperm cells of any studied organism on Earth",
        "score": 311.0,
        "commentCount": 18.0
    },
    {
        "id": "t3_18laxzq",
        "createdAt": "2023-12-18T15:09:45.600000+0000",
        "title": "TIL that \"The Chipmunk Song (Christmas Don't Be Late)\" was the first piece of Alvin & the Chipmunks media to be created, by a singer who used the stage name David Seville and liked playing around with the speed setting on his tape recorder.",
        "score": 778.0,
        "commentCount": 46.0
    },
    {
        "id": "t3_18lbu2f",
        "createdAt": "2023-12-18T15:47:54.457000+0000",
        "title": "TIL that the famous Christmas Carol, \"Jingle Bells\" was written by the uncle of J. P. Morgan. In the later verses, they lose control of the sleigh, crash, get laughed at, then are encouraged to pick up more girls and faster horses. It also was not originally a Christmas song.",
        "score": 2963.0,
        "commentCount": 107.0
    },
    {
        "id": "t3_18lbytu",
        "createdAt": "2023-12-18T15:53:32.035000+0000",
        "title": "TIL in 1919, during the trial of Anton Graf von Arco auf Valley for killing Minister President of the People's State of Bavaria Kurt Eisner, the prosecutor said that \"If the whole German youth were imbued with such a glowing enthusiasm we could face the future with confidence\"",
        "score": 160.0,
        "commentCount": 4.0
    },
    {
        "id": "t3_18ldee1",
        "createdAt": "2023-12-18T16:53:30.551000+0000",
        "title": "TIL that in SailGP each team is obligated to share their full performance data with other teams after every race.",
        "score": 1463.0,
        "commentCount": 40.0
    },
    {
        "id": "t3_18lexec",
        "createdAt": "2023-12-18T17:56:26.456000+0000",
        "title": "TIL that large radiation doses do not guarantee cancer. A dose of one (1) Sievert would put you in the hospital with acute radiation sickness, but the odds of dying from radiation-induced cancer would be <5%. Eating 100 grams of enriched uranium corresponds to a cancer risk of <2%.",
        "score": 2976.0,
        "commentCount": 240.0
    },
    {
        "id": "t3_18lfv2i",
        "createdAt": "2023-12-18T18:34:12.452000+0000",
        "title": "TIL Kentucky Fried Chicken ran out of chicken in the UK. KFC started to shut down locations in response to their missing ingredient, meaning that by February 18, 2018 only 266 of the 870 restaurants in the UK and Ireland were open.",
        "score": 10480.0,
        "commentCount": 579.0
    },
    {
        "id": "t3_18lg0yc",
        "createdAt": "2023-12-18T18:41:00.653000+0000",
        "title": "TIL That hail cannons are supposedly used to prevent the formation of hail",
        "score": 1499.0,
        "commentCount": 35.0
    },
    {
        "id": "t3_18lgoyi",
        "createdAt": "2023-12-18T19:08:19.657000+0000",
        "title": "TIL the Grasshopper Mouse hunts scorpions and howls at the moon.",
        "score": 2384.0,
        "commentCount": 55.0
    },
    {
        "id": "t3_18lgwz4",
        "createdAt": "2023-12-18T19:17:08.559000+0000",
        "title": "TIL that 7-Eleven owns a bank. Its primary business is operating 16,000 ATMs in 7-Elevens throughout Japan.",
        "score": 1241.0,
        "commentCount": 30.0
    },
    {
        "id": "t3_18li5sr",
        "createdAt": "2023-12-18T20:07:59.064000+0000",
        "title": "TIL that Kim Jong-il was so obsessed with films that he kidnapped a South Korean actress and her ex husband, who was a famous director to improve North Korean cinema.",
        "score": 3245.0,
        "commentCount": 86.0
    },
    {
        "id": "t3_18ljmqa",
        "createdAt": "2023-12-18T21:08:59.246000+0000",
        "title": "TIL that Northern Rhodesia achieved their independence from the UK as Zambia on the same day as the closing ceremony of the 1964 Summer Olympics in Tokyo, Japan (Oct. 24, 1964). The Zambian athletes therefore marched into the stadium with a placard showing the country's new name.",
        "score": 178.0,
        "commentCount": 4.0
    },
    {
        "id": "t3_18ll1lb",
        "createdAt": "2023-12-18T22:07:25.285000+0000",
        "title": "TIL that in 2020, a live-action Frosty The Snowman remake with Jason Momoa voicing Frosty was announced to be in development at Warner Bros, but Momoa claimed the announcement was a distraction from allegations by Ray Fisher of mistreatment on the set of Justice League.",
        "score": 275.0,
        "commentCount": 10.0
    },
    {
        "id": "t3_18lleva",
        "createdAt": "2023-12-18T22:23:11.712000+0000",
        "title": "TIL in 1943, a US bomber over Germany was hit by explosive ordnance directly in the fuel tanks 11 times, but none exploded. After the shells were cut open, all were found to have no explosives in them, and one contained a note in Czech saying \"This is all we can do for you now\".",
        "score": 46479.0,
        "commentCount": 1329.0
    },
    {
        "id": "t3_18llju0",
        "createdAt": "2023-12-18T22:29:14.571000+0000",
        "title": "TIL We don't know what the Romans called the Colosseum",
        "score": 5011.0,
        "commentCount": 430.0
    },
    {
        "id": "t3_18llnza",
        "createdAt": "2023-12-18T22:33:54.206000+0000",
        "title": "TIL when Greece won its independence in 1822, Athens was reduced to a small village of 4,000 inhabitants that had faded into irrelevance over centuries. It was selected as the capital for historical and sentimental reasons. The city is now the largest in Greece with over 3 million inhabitants",
        "score": 10392.0,
        "commentCount": 222.0
    },
    {
        "id": "t3_18lmdn4",
        "createdAt": "2023-12-18T23:03:57.671000+0000",
        "title": "TIL that the 13th month is called undecimber and the java programming language supports it",
        "score": 90.0,
        "commentCount": 21.0
    },
    {
        "id": "t3_18lme47",
        "createdAt": "2023-12-18T23:04:32.460000+0000",
        "title": "TIL - One of the 8 Hawaiian islands, Ni’ihau, is known as The Forbidden Island. It’s privately owned, you can’t visit without an invitation, there were 84 residents in the 2020 census, and they live primitively, like their ancestors.",
        "score": 8391.0,
        "commentCount": 327.0
    },
    {
        "id": "t3_18lnl27",
        "createdAt": "2023-12-18T23:56:13.798000+0000",
        "title": "TIL that Ginger Beef is a primarily Canadian dish",
        "score": 226.0,
        "commentCount": 132.0
    },
    {
        "id": "t3_18lo0ij",
        "createdAt": "2023-12-19T00:15:35.897000+0000",
        "title": "TIL Jingle Bells was the first song played in space, as a prank",
        "score": 51.0,
        "commentCount": 1.0
    },
    {
        "id": "t3_18lod12",
        "createdAt": "2023-12-19T00:31:44.090000+0000",
        "title": "TIL about \"Snow Jelly\" or \"Hasma\", a dessert of the province of Heilongjiang, China, that is made with fallopian tubes of frogs and rock sugar.",
        "score": 456.0,
        "commentCount": 131.0
    },
    {
        "id": "t3_18lodrv",
        "createdAt": "2023-12-19T00:32:43.603000+0000",
        "title": "TIL an 8th time DUI offender killed a 24 year old motorcyclist and got 8-17 years in jail back in 2013(USA), and that mandatory minimums in PA(USA) were 3 years per vehicular homicide, and is now 7 years minimum due to this death if you have at least 2 prior DUI convictions",
        "score": 1923.0,
        "commentCount": 250.0
    },
    {
        "id": "t3_18lp7li",
        "createdAt": "2023-12-19T01:11:55.803000+0000",
        "title": "TIL the words zucchini, courgette, and gourd all come from the same root — the Latin word “cucurbita”",
        "score": 128.0,
        "commentCount": 12.0
    },
    {
        "id": "t3_18lpepb",
        "createdAt": "2023-12-19T01:21:27.009000+0000",
        "title": "Today I learned that the Christmas song \"The Little Drummer Boy\" was first recorded by the Von Trapp Family, and its original title is \"Carol of the Drum\".",
        "score": 98.0,
        "commentCount": 8.0
    },
    {
        "id": "t3_18lpn9n",
        "createdAt": "2023-12-19T01:32:42.711000+0000",
        "title": "TIL that Infection, the first Venezuelan zombie film, has been banned in the country despite horror being a popular genre there.",
        "score": 278.0,
        "commentCount": 16.0
    },
    {
        "id": "t3_18lpsop",
        "createdAt": "2023-12-19T01:39:45.719000+0000",
        "title": "TIL It would take 18 months to walk the great wall of China",
        "score": 8175.0,
        "commentCount": 387.0
    },
    {
        "id": "t3_18lq9tv",
        "createdAt": "2023-12-19T02:02:38.282000+0000",
        "title": "TIL: High levels of \"lipoprotein a\" led to celebrity trainer Bob Harper's heart attack at age 52. One in five people have high levels of Lp(a) but the test is not part of standard heart health screening lab tests.",
        "score": 739.0,
        "commentCount": 10.0
    },
    {
        "id": "t3_18lqhys",
        "createdAt": "2023-12-19T02:14:01.140000+0000",
        "title": "TIL the Geothermal energy in Iceland. Almost all of Iceland's electricity and heat comes from geothermal energy, giving the country one of the cleanest energy systems in the world.",
        "score": 489.0,
        "commentCount": 24.0
    },
    {
        "id": "t3_18lqojw",
        "createdAt": "2023-12-19T02:22:43.310000+0000",
        "title": "TIL that Amelia Earhart had a copilot when she went missing. His name is Fred Noonan.",
        "score": 2583.0,
        "commentCount": 187.0
    },
    {
        "id": "t3_18lr93n",
        "createdAt": "2023-12-19T02:50:54.135000+0000",
        "title": "TIL: There is a series of active volcanoes beneath Antarctica: Not only is Antarctica the coldest place in the world, there are at least 91 active volcanoes hidden under its ice sheet, forming the so-called \"Antarctic Volcanic Arc.\"",
        "score": 92.0,
        "commentCount": 5.0
    },
    {
        "id": "t3_18lrdd8",
        "createdAt": "2023-12-19T02:56:51.440000+0000",
        "title": "TIL before people were drinking coffee, it was called \"bunk\" and people washed their hands with it",
        "score": 1110.0,
        "commentCount": 55.0
    },
    {
        "id": "t3_18lse98",
        "createdAt": "2023-12-19T03:48:41.116000+0000",
        "title": "TIL that tropical Storms Were Once Named After Wives, Girlfriends, and Disliked Politicians",
        "score": 82.0,
        "commentCount": 2.0
    },
    {
        "id": "t3_18ltflm",
        "createdAt": "2023-12-19T04:42:00.140000+0000",
        "title": "TIL that Paul Jacobs once performed on the organ for 18 hours straight, and has MEMORIZED all of the music written by Bach, Brahms, Franck, and Messiaen",
        "score": 211.0,
        "commentCount": 13.0
    },
    {
        "id": "t3_18lv482",
        "createdAt": "2023-12-19T06:16:39.921000+0000",
        "title": "TIL that hundreds of Minneapolis street names were changed to numbers all at once back in 1873.",
        "score": 87.0,
        "commentCount": 5.0
    },
    {
        "id": "t3_18lvvp4",
        "createdAt": "2023-12-19T07:04:44.921000+0000",
        "title": "TIL that for 500 years, everyone who attained a BA at Oxford had to swear undying enmity towards a person named Henry Symeonis.",
        "score": 6720.0,
        "commentCount": 204.0
    },
    {
        "id": "t3_18lxg02",
        "createdAt": "2023-12-19T08:53:48.857000+0000",
        "title": "TIL that a family of wasps has caused multiple airplane incidents",
        "score": 200.0,
        "commentCount": 32.0
    },
    {
        "id": "t3_18lz92b",
        "createdAt": "2023-12-19T10:58:24.844000+0000",
        "title": "TIL that the meteorite that hit earth 66 million years ago created a tsunami at least 100m high, if it hit deeper waters, it could’ve produced a tsunami 4.6km high",
        "score": 3717.0,
        "commentCount": 109.0
    },
    {
        "id": "t3_18m065c",
        "createdAt": "2023-12-19T11:55:57.035000+0000",
        "title": "TIL after France’s last king Louis Philippe I was overthrown, his successor Louis Philippe II would later fight in the American Civil War as a Union officer",
        "score": 411.0,
        "commentCount": 10.0
    },
    {
        "id": "t3_18m0wxy",
        "createdAt": "2023-12-19T12:38:01.728000+0000",
        "title": "TIL the artificial Christmas tree with the world's largest number of lights on it is in Universal Studios Japan. They have repeatedly broken their own Guinness world record since 2011",
        "score": 248.0,
        "commentCount": 31.0
    },
    {
        "id": "t3_18m1qjp",
        "createdAt": "2023-12-19T13:20:59.632000+0000",
        "title": "TIL The remotest point of land from any sea in the world is located in the Gurbantünggüt Desert, which is located in Xinjiang, China.",
        "score": 57.0,
        "commentCount": 2.0
    },
    {
        "id": "t3_18m1r3y",
        "createdAt": "2023-12-19T13:21:49.234000+0000",
        "title": "TIL the most expensive dinosaur specimen and fossil ever sold is a T-Rex skeleton known as Stan that sold at auction for $31.8 million in Oct 2020. It's 70% complete and is the 5th most complete T-Rex fossil ever discovered. It's scheduled to be displayed in 2025 at a museum in Abu Dhabi.",
        "score": 3314.0,
        "commentCount": 107.0
    },
    {
        "id": "t3_18m2fyb",
        "createdAt": "2023-12-19T13:55:37.227000+0000",
        "title": "TIL the real inventor of nachos was a Mexican maître d' Ignacio Anaya. In Spanish, \"Nacho\" is a common nickname for Ignacio.",
        "score": 1629.0,
        "commentCount": 58.0
    },
    {
        "id": "t3_18m2l5s",
        "createdAt": "2023-12-19T14:02:21.461000+0000",
        "title": "TIL Researchers at Rice University have been using dead spiders to pioneer a new field of robotics called Necrobotics",
        "score": 832.0,
        "commentCount": 138.0
    },
    {
        "id": "t3_18m30ho",
        "createdAt": "2023-12-19T14:21:49.616000+0000",
        "title": "TIL of the Ninjas, a Congolese Militia active from the early 1990s to 2008, and briefly active from 2016 to 2017. Formed by politician Bernard Kolelas and Commanded by Frederic Bintsamou, aka Pastor Ntoumi, they were known for their purple clothes, which symbolized suffering, and dreadlocks.",
        "score": 19.0,
        "commentCount": 0.0
    },
    {
        "id": "t3_18m35nj",
        "createdAt": "2023-12-19T14:28:35.120000+0000",
        "title": "TIL the Australian town Korumburra holds an annual festival to celebrate Giant Gippsland Earthworms that average nearly 3.3 feet long with 300-400 body segme",
        "score": 7.0,
        "commentCount": 2.0
    },
    {
        "id": "t3_18m4k6m",
        "createdAt": "2023-12-19T15:30:12.556000+0000",
        "title": "TIL that Somerset Bridge in Bermuda is the world's smallest drawbridge. At just 56cm wide, it takes 2 seconds to cross.",
        "score": 842.0,
        "commentCount": 33.0
    },
    {
        "id": "t3_18m4qcg",
        "createdAt": "2023-12-19T15:37:20.933000+0000",
        "title": "TIL four states specifically mention paranormal activity in their real estate disclosure laws: New York, New Jersey, Massachusetts and Minnesota.",
        "score": 610.0,
        "commentCount": 51.0
    },
    {
        "id": "t3_18m8b1j",
        "createdAt": "2023-12-19T18:09:33.625000+0000",
        "title": "TIL that Napoleon Bonaparte's grand nephew founded the FBI",
        "score": 323.0,
        "commentCount": 8.0
    },
    {
        "id": "t3_18m8smt",
        "createdAt": "2023-12-19T18:29:49.516000+0000",
        "title": "TIL: Steve Glew, was a smuggler who made millions smuggling PEZ dispensers. This is due to collectors willing to pay very high prices for rare PEZ, with one shipment being worth $500,000. He made $4.5 million over 11 years and had a documentary made about him, \"The Pez Outlaw\".",
        "score": 1302.0,
        "commentCount": 58.0
    },
    {
        "id": "t3_18m9g6c",
        "createdAt": "2023-12-19T18:57:17.122000+0000",
        "title": "TIL coinciding with the release of the book Fifty Shades of Grey, injuries related to BDSM and sex toy use spiked dramatically with injuries requiring Emergency Room visits spiking from previous years by over 50%",
        "score": 214.0,
        "commentCount": 21.0
    },
    {
        "id": "t3_18m9p66",
        "createdAt": "2023-12-19T19:07:31.713000+0000",
        "title": "TIL that before the Fascists, there was the Fasci Siciliani, a revolutionary traditionalist and nationalist/socialist movement in Sicily in the 1890s revolting against the landowning class in the midst of the Depression of 1893",
        "score": 27.0,
        "commentCount": 2.0
    },
    {
        "id": "t3_18m9vnr",
        "createdAt": "2023-12-19T19:15:08.533000+0000",
        "title": "TIL Eton College was founded in 1441 as a charity school providing free education. It is now one of the most expensive schools in the UK.",
        "score": 124.0,
        "commentCount": 6.0
    },
    {
        "id": "t3_18m9z11",
        "createdAt": "2023-12-19T19:19:00.372000+0000",
        "title": "TIL that Iwo Jima has increased in size by about 9 square km since the Battle of Iwo Jima in 1945",
        "score": 368.0,
        "commentCount": 7.0
    },
    {
        "id": "t3_18maf4o",
        "createdAt": "2023-12-19T19:37:35.524000+0000",
        "title": "TIL, Bananas grow toward the sun against gravity, which gives the fruit its curved shape.",
        "score": 122.0,
        "commentCount": 10.0
    }
]